<a href="https://colab.research.google.com/github/ibk25244/su-ai/blob/master/5_pandas_very_short_crash_course_sol.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- - -

<font size=6 color='royalblue'>판다스 극초단기 입문</font>

<font size=5 color='forestgreen'>Pandas Primer: A Very Short Crash Course</font> 

* * *

**<font size=4>박 진 수</font>** 교수  
Intelligent Data Semantics Lab  
Seoul National University

- - -

>[판다스(Pandas)란?](#scrollTo=KoP5rVzMmsKL)

>[관련 모듈 불러오기](#scrollTo=RhpsqBd-msKM)

>[판다스 시리즈(Series)](#scrollTo=hX5ZQSYPmsKS)

>>[Lab: __TODO__ 채우기](#scrollTo=uLpQj2VHmsKv)

>[판다스 데이터프레임(DataFrame)](#scrollTo=eto6svfUmsLO)

>>[Lab: 데이터프레임 구성하기](#scrollTo=6j_LLgRumsL7)

>[데이터 호출 및 저장](#scrollTo=Xdw8F2dN2qDW)

>>[실습 파일 내려받기](#scrollTo=xQlb6YCAY2Vn)

>>[CSV와 텍스트 데이터](#scrollTo=BmMRa9UaY2Vs)

>>[엑셀 데이터 불러오기](#scrollTo=-wJc3kTWY2Wc)

>>>[Lab: 엑셀 파일을 데이터프레임으로 불러오기](#scrollTo=aaRMilt1Y2Wj)

>>[HTML 파일 불러오기](#scrollTo=t9BfDPXzY2Wo)

>>[JSON 파일 불러오기](#scrollTo=UdhaPHaKY2W3)

>>[클립보드 내용 불러오기](#scrollTo=P0TItuHOY2XI)

>>[데이터 저장하기](#scrollTo=YGYoCDfuY2XJ)

>>>[Lab: 데이터프레임을 엑셀 파일로 저장하기](#scrollTo=DuzG_ZZrY2XW)

>[데이터프레임 열람](#scrollTo=tJT2FfE3msMD)

>[데이터프레임 인덱스](#scrollTo=wayBOMZXmsOG)

>[데이터프레임 갱신](#scrollTo=OOB9hmdcmsOX)

>[데이터프레임 병합](#scrollTo=Bcy9f-XSmsO-)

>>[concat() 메소드](#scrollTo=bV2TFmDdmsO-)

>>[merge() 메소드](#scrollTo=VOScPofDmsPR)

>[피벗 테이블](#scrollTo=gWlDrFHL7srs)

>[THE END](#scrollTo=UO5CCoeGmsPZ)

# 판다스(Pandas)란?

데이터 전처리와 준비를 효과적으로 할 수 있도록 도와주는 파이썬 라이브러리다.
- 파이썬 데이터 분석 라이브러리(**P**ytho**n** **D**ata **A**nalysi**s** Library)
    - 또는 패널 데이터 분석(**Pan**el **D**ata **A**nalysi**s** Library)
- 재무 데이터에 대한 정량 분석을 위해 2008년 AQR 캐피탈 매니지먼트 소속의 웨스 맥키니(Wes McKinney)가 개발한 유연한 고성능 파이썬 툴이다.
- 비시계열 데이터 뿐만 아니라 시계열 데이터를 다룰 수 있는 기능을 제공하고 있다.
- 엑셀의 시트와 같은 '관계형' 또는 '테이블 형' 데이터인 '데이터프레임(DataFrame)'을 활용하여 데이터를 쉽게 처리할 수 있다.
- 넘파이(NumPy)에 기반하고 있다.
    - Numpy는 계산과학(computation science)분야에서 자주 활용하는 파이썬 라이브러리다.
    - NumPy와 통합하여 사용하기 위해 설계되었다.
- 판다스는 Numpy보다 더 복잡한 형태의 자료인 시리즈(Series), 데이터프레임(DataFrame) 등을 다루지만, Numpy를 이용해 만든 배열(array) 자료를 이용해서 시리즈(Series)나 데이터프레임(DataFrame) 자료를 생성하거나 수정할 수 있다. 
- 판다스의 **기본 데이터 구조**는 두 개다.
    - **시리즈**(Series)
    - **데이터프레임**(DataFrame)
- Documentation
    - <http://pandas.pydata.org/pandas-docs/stable/>

# 관련 모듈 불러오기

**import pandas**로 pandas를 불러와서 사용해야 한다.
- 주로 **import pandas as pd**로 pandas를 불러와서, 짧게 *pd*로 사용하는 경우가 많다.

In [ ]:
import pandas  # as pd
import numpy   # as np 

print('Pandas version...:', pandas.__version__)
print('NumPy version....:', numpy.__version__)

Pandas version...: 1.0.5
NumPy version....: 1.18.5

# 판다스 시리즈(Series)

**시리즈**(Series)란?
- 1차원 데이터를 표현하는 판다스의 자료구조다.
    + 인텍스(index)가 있는 1차원 리스트 또는 배열
        - 인덱스(index)와 데이터 값(value)으로 구성되어 있다.
        - 시리즈 이름('name')을 설정할 수 있다.
- 넘파이(NumPy)의 1차원 배열(array)과 유사하지만 넘파이(NumPy)의 1차원 배열과는 다르게 이종 자료형도 시리즈(Series) 내에 담을 수 있다.
- 엑셀의 스프레드시트와 같은 데이터에서 하나의 행, 혹은 열을 나타낸다.

[pandas.Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)
- One-dimensional ndarray with axis labels (including time series)
- [pandas.**Series**(*data=None, index=None, dtype=None, name=None, copy=False, fastpath=False*)](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series)
    - ***data*** : *array-like, Iterable, dict, or scalar value*
        - Contains data stored in Series.
        - If data is a dict, argument order is maintained for Python 3.6 and later.
    - ***index*** : *array-like or Index (1d)*
        - Values must be hashable and have the same length as *data*. Non-unique index values are allowed. Will default to RangeIndex (0, 1, 2, …, n) if not provided. If both a dict and index sequence are used, the index will override the keys found in the dict.

**<font size='+1'>시리즈 구성하기</font>**

[pandas.Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)
- One-dimensional ndarray with axis labels (including time series).
- *class* pandas.**Series**(*data=None, index=None, dtype=None, name=None, copy=False, fastpath=False*)
    + ***data*** 에는
        - 리스트
        - 딕셔너리
        - 튜플
        - Scalar 값 (숫자, 문자열 등)
    + 등이 들어갈 수 있다.

파이썬 리스트와 비슷하지만 파이썬 딕셔너리의 역할도 한다.

예로 다음과 같은 주식 데이터가 있다고 가정하자.

| Date | Company A |
|------|-----------|
|2025-5-12| 52600|
|2025-5-13| 52400|
|2025-5-14| 52100|
|2025-5-15| 52300|
|2025-5-16| 52500|

**판다스 시리즈**는

- 인덱스와 값을 동시에 저장한다.
- 뿐만 아니라 내가 원하는 인덱스를 지정하는 것도 가능하다.
- 인덱스와 값으로 저장하기 때문에, 인덱스를 이용해 데이터를 검색할 수 있다.
- 이는 파이썬의 딕셔너리(dictionary)와 비슷하다.

In [ ]:
# 판다스 시리저는 자동으로 인덱스과 값을 동시에 저장한다.
stock_price = pandas.Series([52600, 52400, 52100, 52300, 52500])
stock_price

0    52600
1    52400
2    52100
3    52300
4    52500
dtype: int64

In [ ]:
# --- 원하는 인덱스를 지정하는 것도 가능하다.
# (1) 날짜 인덱스를 생성한다.
dates = pandas.date_range('2025-5-12', periods=5)
dates

DatetimeIndex(['2025-05-12', '2025-05-13', '2025-05-14', '2025-05-15',
               '2025-05-16'],
              dtype='datetime64[ns]', freq='D')

[pandas.date_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html#pandas.date_range)
- Return a fixed frequency DatetimeIndex.
- pandas.**date_range**(*start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, \**kwargs*)

In [ ]:
# (2) 날짜를 인덱스로 지정한다.
stock_price = pandas.Series([52600, 52400, 52100, 52300, 52500], 
                            index=dates)
stock_price

2025-05-12    52600
2025-05-13    52400
2025-05-14    52100
2025-05-15    52300
2025-05-16    52500
Freq: D, dtype: int64

In [ ]:
# 인덱스와 값으로 저장하기 때문에
# 인덱스 문자열을 이용해 데이터를 검색할 수 있다.
# 이는 파이썬의 딕셔너리(dictionary)와 비슷하다.
stock_price['2025-5-15']

52300

In [ ]:
# 인덱스에 접근하려면 .index
for date in stock_price.index:
  print(date)

2025-05-12 00:00:00
2025-05-13 00:00:00
2025-05-14 00:00:00
2025-05-15 00:00:00
2025-05-16 00:00:00

In [ ]:
# 인덱스의 값에 접근하려면 .to_numpy() 또는 .values
for value in stock_price.to_numpy():
  print(value)

52600
52400
52100
52300
52500

**<font size='+1'>Not a Number</font>**

**numpy.nan**를 통해 **NaN(Not a Number)** 표현이 가능하다.  **NaN** 은 정의할 수 없는 숫자를 나타내는 말로서 
- 연산을 수행한 후 그 결과 값을 숫자로 표현할 수 없는 실수(float) 값 또는
- 판다스에서 결측치(missing data)를 의미할 때 사용한다.

In [ ]:
# numpy.nan이 있으면 자료형은 실수다.
s1 = pandas.Series([1, 2, 3, numpy.nan, 4, 5])
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

**<font size='+1'>이종 자료형</font>**

numpy의 배열과 달리 이종 자료형도 시리즈 내에 담을 수 있다.
- 이런 점에서는 파이썬 리스트와 유사하다.

In [ ]:
# numpy의 배열과 달리 이종 자료형도 담을 수 있다. 이 경우 자료형은 object이다.
s2 = pandas.Series([1, 4, 7, 8, 9, 10, 'a'])
s2

0     1
1     4
2     7
3     8
4     9
5    10
6     a
dtype: object

**<font size='+1'>시리즈 인덱싱</font>**

두 시리즈에서 
- 각 시리즈 객체의 인덱싱 순서는 다를 수 있지만, 
- 같은 인덱스끼리는 연산을 수행한다.

In [ ]:
student1 = pandas.Series([91, 73, 60], 
                         index=['english', 'math', 'science'])
student1

english    91
math       73
science    60
dtype: int64

In [ ]:
student2 = pandas.Series([84, 55, 90], 
                         index=['science', 'english', 'math'])
student2

science    84
english    55
math       90
dtype: int64

In [ ]:
student1 + student2

english    146
math       163
science    144
dtype: int64

***시리즈가 담고 있는 객체의 수가 다르면?***

In [ ]:
student3 = pandas.Series([99, 84, 55, 90], 
                         index=['music', 'science', 'english', 'math'])
student3

music      99
science    84
english    55
math       90
dtype: int64

In [ ]:
student1 + student3

english    146.0
math       163.0
music        NaN
science    144.0
dtype: float64

## Lab: \_\_TODO__ 채우기

**<font size='+1'>리스트로 시리즈 구성</font>**

In [ ]:
import pandas

# 리스트로 시리즈를 구성한다.
# 인덱스 값을 지정하지 않으면 0부터 자동으로 인덱스가 부여된다.
L = list('abcde')

s = pandas.Series(L)
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

**<font size='+1'>시리즈 인덱싱</font>**

In [ ]:
# 인덱스를 명시적으로 지정하여 시리즈를 구성한다.
# 인덱스의 길이는 리스트의 길이와 같아야 한다.
s1 = pandas.Series(L, index=['string', 3, 0.98, True, -5])
print(s1)

s2 = pandas.Series(L, index=range(10, 15))
print(s2)

string    a
3         b
0.98      c
True      d
-5        e
dtype: object
10    a
11    b
12    c
13    d
14    e
dtype: object

**<font size='+1'>딕셔너리로 시리즈 구성</font>**

In [ ]:
# 딕셔너리로 시리즈를 구성한다.
# 딕셔너리의 키가 생성된 시리즈의 인덱스가 된다.
d = {
  'english': 55,
  'math' : 'I',
  'science' : 'P',
  'music' : 99,
  'python' : [89, 72, 91, 85, 88]
}

s3 = pandas.Series(d)
print(s3)

english                      55
math                          I
science                       P
music                        99
python     [89, 72, 91, 85, 88]
dtype: object

**<font size='+1'>특정 인덱스만 선택하여 시리즈 구성</font>**

In [ ]:
# 특정 인덱스만 선택하여 시리즈를 구성한다.
s4 = pandas.Series(d, index=['python', 'music', 'math'])
print(s4)

python    [89, 72, 91, 85, 88]
music                       99
math                         I
dtype: object

**<font size='+1'>튜플로 시리즈 구성</font>**

In [ ]:
# 튜플로 시리즈를 구성한다.
t = 101, 201, 301, 401, 501

s5 = pandas.Series(t)
print(s5)

0    101
1    201
2    301
3    401
4    501
dtype: int64

**<font size='+1'>스칼라(scalar) 값으로 시리즈 구성</font>**

In [ ]:
# 정수 한 개로 시리즈를 구성한다.
s6 = pandas.Series(55)
print(s6)

# 실수 한 개로 시리즈를 구성한다.
s7 = pandas.Series(3.14)
print(s7)

# 문자열 한 개로 시리즈를 구성한다.
# 인덱스에 리스트 값을 지정하면 인덱스 리스트 크기의 시리즈를 구성할 수 있다.
s8 = pandas.Series('value', index=range(10))
print(s8)

0    55
dtype: int64
0    3.14
dtype: float64
0    value
1    value
2    value
3    value
4    value
5    value
6    value
7    value
8    value
9    value
dtype: object

**<font size='+1'>시리즈 이름 설정</font>**

In [ ]:
# 시리즈의 name을 설정할 수 있다.
s9 = pandas.Series(L, name='알파벳')
print(s9)

# 다른 name으로 바꿀 수도 있다.
s9.name = 'alphabet'
print(s9)

0    a
1    b
2    c
3    d
4    e
Name: 알파벳, dtype: object
0    a
1    b
2    c
3    d
4    e
Name: alphabet, dtype: object

# 판다스 데이터프레임(DataFrame)

- 2차원의 자료구조다.
    - 2차원 배열 혹은 리스트와 유사한 자료 구조다.
- 시리즈(Series)의 집합이다.
- 행렬(matrix)과 같이 행(row)과 열(column)로 이루어져 있으며, 인덱스를 이용해 접근이 가능하다.
    - 두 개의 축(axis)이 있어 행과 열을 관리한다.
- 데이터프레임도 시리즈처럼 이종 자료형을 담을 수 있다.   

[pandas.DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html)
- Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 
- [pandas.**DataFrame**(*data=None, index=None, columns=None, dtype=None, copy=False)*](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame)
    + ***data*** 에는
         - 1차원의 리스트, 딕셔너리 혹은 시리즈를 값(**value**)으로 갖는 딕셔너리
         - 1차원의 리스트, 딕셔너리 혹은 시리즈의 리스트
         - 시리즈(Series)
         - 데이터프레임(DataFrame)
    + 등이 들어갈 수 있다.

**<font size='+1'>배열/리스트로 데이터프레임 구성하기</font>**

In [ ]:
# 넘파이 배열(array)로 데이터프레임을 구성한다.
df1 = pandas.DataFrame(numpy.zeros((2, 3)))
df1

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0

In [ ]:
# 파이썬 리스트 자료형으로 데이터프레임을 구성한다.
df2 = pandas.DataFrame([[1, 2, 3], [4, 5, 6]])
df2

   0  1  2
0  1  2  3
1  4  5  6

In [ ]:
# 중첩 리스트(리스트의 리스트: 2차원 리스트)로 데이터프레임을 구성한다.
list_of_list = [
    ['John', 'Tim', 'Elizabeth', 'Bruce', 'Nancy'],
    ['A+', 'B-', 'F'],
    ['M', 'M', 'F', 'M', 'F'],
    [None, {}, 3.14, True]
]

df3 = pandas.DataFrame(list_of_list)
df3

      0    1          2      3      4
0  John  Tim  Elizabeth  Bruce  Nancy
1    A+   B-          F   None   None
2     M    M          F      M      F
3  None   {}       3.14   True   None

**<font size='+1'>딕셔너리로 데이터프레임 구성하기 : 기초</font>**

- 딕셔너리 형태로 구성하는 것이 제일 간편하다.

**키 = 열(컬럼) 이름**

In [ ]:
names = ['John', 'Tim', 'Bruce']
grades = ['A+', 'B-', 'F']
d = {'grade': grades, 'name': names}
d

{'grade': ['A+', 'B-', 'F'], 'name': ['John', 'Tim', 'Bruce']}

In [ ]:
# 파이썬 딕셔너리 자료형으로 데이터프레임을 생성한다.
# 이렇게 하면 카가 열의 인덱스 값으로 사용된다.
df4 = pandas.DataFrame(d)
df4

  grade   name
0    A+   John
1    B-    Tim
2     F  Bruce

**열(컬럼) 순서 지정하기**

이때 딕셔너리 자료형의 특성 때문에 열의 순서가 임의로 정해질 수 있는데 이를 원하는 순서로 지정하려면 컬럼 값을 지정하면 된다.

In [ ]:
# 열의 순서를 정할 수 있다.
df5 = pandas.DataFrame(d, columns=['name', 'grade'])
df5

    name grade
0   John    A+
1    Tim    B-
2  Bruce     F

**열(컬럼) 이름으로 접근하기**

키가 열의 이름이기 때문에 마치 딕셔너리에 접근하듯이 열(컬럼)의 이름으로 데이터에 접근이 가능하다.

In [ ]:
# df5에서 name 열의 데이터를 열람한다.
df5['name']

0     John
1      Tim
2    Bruce
Name: name, dtype: object

또한 클래스의 속성에 접근하듯이 열 이름으로 접근이 가능하다.

In [ ]:
# df5에서 name 열의 데이터를 열람한다.
# 위와 동일하게 작동한다.
df5.name

0     John
1      Tim
2    Bruce
Name: name, dtype: object

**열(컬럼) 자료형은?**

각 열의 자료형은 시리즈(Series)이다.

In [ ]:
# df5의 grade 열의 자료형을 확인한다.
type(df5.grade)

pandas.core.series.Series

**인덱스 값 지정하기**

인덱스의 값도 지정할 수 있다.

In [ ]:
student_id = ['1111', '1112', '1113']
df6 = pandas.DataFrame(d, index=student_id)
df6

     grade   name
1111    A+   John
1112    B-    Tim
1113     F  Bruce

**<font size='+1'>열(컬럼)과 인덱스 이름을 지정하고 데이터프레임 구성하기</font>**

- 열 이름과 인덱스를 전달인자로 설정할 수 있다.
- 따로 설정하지 않을 경우 기본값(**0**부터 시작하는 정수)으로 설정된다.

[참고]
- [numpy.random.randn](https://docs.scipy.org/doc/numpy/reference/generated/numpy.random.randn.html?highlight=randn#numpy.random.randn)
    - Return a sample (or samples) from the “standard normal” distribution.
    - numpy.**random.randn**(*d0, d1, ..., dn*)

In [ ]:
df1 = pandas.DataFrame(
    numpy.random.randn(10, 3),  # shape of (10, 3)
    index=list('abcdefghij'), 
    columns=list('ABC')
)
df1

          A         B         C
a  0.503891  0.812038 -1.042983
b  1.438733 -0.354790  0.268121
c -0.914177 -0.780485  1.096936
d  0.232168 -0.304219 -0.708027
e -0.614871 -0.552910 -0.970913
f -0.642808 -0.666701  0.622208
g -1.822634 -1.192563 -1.839506
h  0.473255 -2.050460 -1.123108
i  0.334233 -1.582742 -1.997992
j  0.823683 -1.037461  0.836463

[numpy.random.mtrand.RandomState.randint](https://docs.scipy.org/doc/numpy/reference/random/generated/numpy.random.mtrand.RandomState.randint.html#numpy.random.mtrand.RandomState.randint)
- Return random integers from ***low*** (inclusive) to ***high*** (exclusive).
- Return random integers from the “discrete uniform” distribution of the specified dtype in the “half-open” interval **[low, high)**. If ***high*** is **None** (the default), then results are from **[0, low)**.
- RandomState.**randint**(*low, high=None, size=None, dtype='l'*)
    - ***low*** : *int or array-like of ints*
        - Lowest (signed) integers to be drawn from the distribution (unless **high=None**, in which case this parameter is one above the highest such integer).
    - ***high*** : *int or array-like of ints, optional*
        - If provided, one above the largest (signed) integer to be drawn from the distribution (see above for behavior if **high=None**). If array-like, must contain integer values
    - ***size*** : *int or tuple of ints, optional*
        - Output shape. If the given shape is, e.g., **(m, n, k)**, then m * n * k samples are drawn. 
        - Default is **None**, in which case a single value is returned.
    - ***dtype*** : *dtype, optional*
        - Desired dtype of the result. All dtypes are determined by their name, i.e., ‘int64’, ‘int’, etc, so byteorder is not available and a specific precision may have different C types depending on the platform. 
        - The default value is ‘np.int’.

In [ ]:
# --- 각 열의 자료형을 다르게 해서 복잡한 데이터프레임을 만들 수 있다.
df2 = pandas.DataFrame({
    'A': pandas.Series(list(range(1, 6)), 
                      index=pandas.date_range('2025-5-12', periods=5),
                      dtype='float32'),
    'B': numpy.random.randint(1, 100, size=5),
    'C': pandas.Categorical(['AAA', 'AA', 'BB', 'B', 'C']),
    'D': 'pd',
    'E': pandas.Timestamp('2050-10-9')
})
df2

              A   B    C   D          E
2025-05-12  1.0  41  AAA  pd 2050-10-09
2025-05-13  2.0  85   AA  pd 2050-10-09
2025-05-14  3.0  76   BB  pd 2050-10-09
2025-05-15  4.0  86    B  pd 2050-10-09
2025-05-16  5.0  19    C  pd 2050-10-09

In [ ]:
# df2 모든 열의 자료형을 확인한다.
df2.dtypes

A           float32
B             int64
C          category
D            object
E    datetime64[ns]
dtype: object

## Lab: 데이터프레임 구성하기

다음 내용의 데이터를 담은 데이터프레임을 구성해 보자.

Index|Title|Artist|Length|Year
:-:|:-:|:-:|:-:|:-:
0|Skyfall|Adele|4:46|2012
1|Lose Yourself|Eminem|5:26|2002
2|Another Brick in the Wall|Pink Floyd|3:59|1979
3|Use Somebody|Kings of Leon|3:51|2008
4|Treasure|Bruno Mars|2:58|2013

**Title**, **Artist**, **Length**는 문자열(string)로, **Year**는 정수형(int)으로 저장한다.

결과로 만들어진 데이터프레임 출력한다.

In [ ]:
d = {
  'Title': ['Skyfall', 'Lose Yourself', 'Another Brick in the Wall', 'Use Somebody', 'Treasure'],
  'Artist': ['Adele', 'Eminem', 'Pink Floyd', 'Kings of Leon', 'Bruno Mars'],
  'Length': ['4:46', '5:26', '3:59', '3:51', '2:58'],
  'Year': [2012, 2002, 1979, 2008, 2013]
}

df_movies = pandas.DataFrame(d)

In [ ]:
df_movies

                       Title         Artist Length  Year
0                    Skyfall          Adele   4:46  2012
1              Lose Yourself         Eminem   5:26  2002
2  Another Brick in the Wall     Pink Floyd   3:59  1979
3               Use Somebody  Kings of Leon   3:51  2008
4                   Treasure     Bruno Mars   2:58  2013

In [ ]:
title = ['Skyfall', 'Lose Yourself', 'Another Brick in the Wall', 'Use Somebody', 'Treasure']
artist = ['Adele', 'Eminem', 'Pink Floyd', 'Kings of Leon', 'Bruno Mars']
length = ['4:46', '5:26', '3:59', '3:51', '2:58']
year = [2012, 2002, 1979, 2008, 2013]

df_movies = pandas.DataFrame({
    'Title': title, 
    'Artist': artist, 
    'Length': length, 
    'Year': year})

In [ ]:
df_movies

                       Title         Artist Length  Year
0                    Skyfall          Adele   4:46  2012
1              Lose Yourself         Eminem   5:26  2002
2  Another Brick in the Wall     Pink Floyd   3:59  1979
3               Use Somebody  Kings of Leon   3:51  2008
4                   Treasure     Bruno Mars   2:58  2013

# 데이터 호출 및 저장

## 실습 파일 내려받기

데이터 파일을 내려받는다.

In [ ]:
# --- wget으로 모든 파일을 'data'라는 하위 폴더에 내려받는다.

# 하위 폴더 'data'가 없으면 새로 만든다.
import os
if not os.path.exists('data'):
    os.makedirs('data')  

!wget -O csv_data.csv -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=15bNIuuFsEAhAaL0EkVjm4ZW32MjjNjFe'
!wget -O csv_data_no_header.csv -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=1K8mCBeD-ytafeCDg3jMpOKuzlnJ_aBfd'
!wget -O csv_data_semicolon.csv -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=1EkvCWCrmgsKXsXppF_PcdzL1DGP7r2c5'
!wget -O excel_data.xlsx -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=1e1Jai4Gob62F9Ijut3AYxJrrzbyC7PTO'
!wget -O animals.xlsx -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=1HXMoFKGi_z8XLPWvJaKAnOsdYejSv5z4'
!wget -O NBA_2019_totals.html -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=1mB6jU4tP_clxt0DuyBMH5z68zRnGz6nA'
!wget -O bitcoin_price.json -q --show-progress --no-check-certificate 'https://docs.google.com/uc?export=download&id=10O0GyM3uyC9H8XBBVcQS_qyi9sc_jR07'

csv_data.csv        100%[===================>]      63  --.-KB/s    in 0s
csv_data_no_header. 100%[===================>]      50  --.-KB/s    in 0s
csv_data_semicolon. 100%[===================>]      68  --.-KB/s    in 0s
excel_data.xlsx     100%[===================>]   8.52K  --.-KB/s    in 0s
animals.xlsx        100%[===================>]  17.46K  --.-KB/s    in 0s
NBA_2019_totals.htm 100%[===================>]   1.23M  --.-KB/s    in 0.009s
bitcoin_price.json  100%[===================>]     511  --.-KB/s    in 0s

## CSV와 텍스트 데이터

**CSV**(comma-separated values)란?
- 데이터의 각 열을 쉼표(**,**)로 구분하여 저장하는 텍스트 파일이다.
- 확장자는 **.csv**다.
- 각 열의 구분자(delimiter)로 쉼표(**,**)가 일반적이지만, 탭('**\t**'), 쌍반점('**;**') 등의 구분자도 자주 사용한다.

판다스(Pandas)도 넘파이(NumPy)와 유사하게 CSV와 텍스트(text) 데이터를 불러올 수 있다.
- **read_csv()** 메소드로 CSV 파일의 데이터를 불러오면 자동으로 데이터프레임으로 저장한다.
- **read_table()** 메소드로 텍스트(text) 파일의 데이터를 불러오면 자동으로 데이터프레임으로 저장한다.

[pandas.read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html#pandas.read_csv)
- Read a comma-separated values (csv) file into DataFrame.
- Also supports optionally iterating or breaking of the file into chunks.
- pandas.**read_csv**(*filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None*)

[pandas.read_table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_table.html#pandas.read_table)
- Read general delimited file into DataFrame.
- Also supports optionally iterating or breaking of the file into chunks.
- pandas.**read_table**(*filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep='t', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None*)

In [ ]:
%pycat csv_data.csv

In [ ]:
# CSV 파일('csv_data.csv')을 불러온다. 
# read_csv()의 기본 구분자는 콤마(',')이다.
df = pandas.read_csv('csv_data.csv')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [ ]:
# 특정 열만 (열 위치로) 선택하여 불러온다.
df = pandas.read_csv('csv_data.csv', usecols=[1, 2])
df

  LAST_NAME  AGE
0       KIM   30
1      CHOI   25
2       LEE   41
3      PARK   19
4       LIM   36

In [ ]:
# 특정 열만 (열 이름으로) 선택하여 불러온다.
df = pandas.read_csv('csv_data.csv', usecols=['LAST_NAME', 'ID'])
df

   ID LAST_NAME
0   1       KIM
1   2      CHOI
2   3       LEE
3   4      PARK
4   5       LIM

In [ ]:
# read_table()을 사용하면 매개변수 sep에 구분자를 설정해야 한다.
# read_table()의 기본 구분자는 탭('\t')이다.
df = pandas.read_table('csv_data.csv', sep=',')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [ ]:
# read_table()로 특정 열만 (열 이름으로) 선택하여 불러온다.
df = pandas.read_table('csv_data.csv', sep=',', usecols=['ID', 'LAST_NAME'])
df

   ID LAST_NAME
0   1       KIM
1   2      CHOI
2   3       LEE
3   4      PARK
4   5       LIM

In [ ]:
# -- 열 이름이 없는 CSV 파일
%pycat csv_data_no_header.csv

1,KIM,30
2,CHOI,25
3,LEE,41
4,PARK,19
5,LIM,36

In [ ]:
# 열 이름이 없는 CSV 파일('csv_data_no_header.csv')을 불러온다. 
# 그런데 첫 번째 행이 열 이름으로 된다.
df = pandas.read_csv('csv_data_no_header.csv')
df

   1   KIM  30
0  2  CHOI  25
1  3   LEE  41
2  4  PARK  19
3  5   LIM  36

In [ ]:
# 따라서 열 이름이 없는 CSV 파일을 불러올 때 열 이름이 없다고 설정해야 한다.
df = pandas.read_csv('csv_data_no_header.csv', header=None)
df

   0     1   2
0  1   KIM  30
1  2  CHOI  25
2  3   LEE  41
3  4  PARK  19
4  5   LIM  36

In [ ]:
# -- 구분자가 쉼표','가 아닌 CSV 파일
%pycat csv_data_semicolon.csv

ID;LAST_NAME;AGE
1;KIM;30
2;CHOI;25
3;LEE;41
4;PARK;19
5;LIM;36

In [ ]:
# 구분자가 쉼표','가 아닌 CSV 파일을 읽을 때는 
# 매개변수 sep에 구분자를 설정해야 한다.
df = pandas.read_csv('csv_data_semicolon.csv', sep=';')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [ ]:
# read_table()을 사용해도 같은 결과를 가져온다.
# read_table()의 기본 구분자는 탭('\t')이다.
df = pandas.read_table('csv_data_semicolon.csv', sep=';')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [ ]:
# 특정 열만 (열 이름으로) 선택하여 불러온다. 
df = pandas.read_csv('csv_data_semicolon.csv', 
                     sep=';', 
                     usecols=('LAST_NAME', 'AGE'))  # list-like (튜플로 가능)
df

  LAST_NAME  AGE
0       KIM   30
1      CHOI   25
2       LEE   41
3      PARK   19
4       LIM   36

## 엑셀 데이터 불러오기

판다스(Pandas)에서는 엑셀(excel) 형태(.xlsx/.xls)의 데이터도 쉽게 불러올 수 있다.
- **read_excel()** 메소드를 통해 데이터를 불러오면 자동으로 데이터프레임으로 저장된다.
    + 매개변수 ***sheet_name***을 설정하지 않으면 기본값인 **0**으로 첫 번째 sheet를 가져온다.
    + ***sheet_name***으로 숫자가 올 수도 있고 sheet 이름이 올 수도 있다. **1**은 두 번째 sheet다.
    + ***sheet_name=None***은 모든 sheet를 가져온다.

[pandas.read_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#pandas.read_excel)
- Read an Excel file into a pandas DataFrame.
- Support both **xls** and **xlsx** file extensions from a local filesystem or URL. 
    - Support an option to read a single sheet or a list of sheets.
- pandas.**read_excel**(*io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, verbose=False, parse_dates=False, date_parser=None, thousands=None, comment=None, skip_footer=0, skipfooter=0, convert_float=True, mangle_dupe_cols=True, \*\*kwds*)

엑셀 파일을 처리하려면 [xlrd](https://xlrd.readthedocs.io/en/latest/) 모듈을 설치해야 한다.

In [ ]:
# 엑셀 파일을 처리하려면 xlrd 모듈을 설치해야 한다.
# Google Colab에는 이미 설치가 되어 있다.
# !pip install --upgrade xlrd

In [ ]:
# 엑셀 파일('excel_data.xlsx')을 불러온다. 
# sheet_name을 설정하지 않으면 기본값인 0으로 첫 번째 sheet를 가져온다.
# sheet_name으로 숫자가 올 수도 있고 sheet 이름이 올 수도 있다.
# sheet_name=None은 모든 sheet를 가져온다.
df = pandas.read_excel('excel_data.xlsx', sheet_name='customers')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

### Lab: 엑셀 파일을 데이터프레임으로 불러오기

---

- 하위 폴더 **data**에 있는 'animals.xlsx' 파일을 불러와 데이터프레임을 생성한 후 출력한다.
- 엑셀 파일의 첫 세 컬럼('name', 'hair', 'feathers')의 데이터만 포함하는 데이터프레임을 생성한 후 출력한다.

---

In [ ]:
df_animals = pandas.read_excel('animals.xlsx')
df_animals

         name  hair  feathers  eggs  milk  ...  legs  tail  domestic  catsize  type
0    aardvark     1         0     0     1  ...     4     0         0        1     1
1    antelope     1         0     0     1  ...     4     1         0        1     1
2        bass     0         0     1     0  ...     0     1         0        0     4
3        bear     1         0     0     1  ...     4     0         0        1     1
4        boar     1         0     0     1  ...     4     1         0        1     1
..        ...   ...       ...   ...   ...  ...   ...   ...       ...      ...   ...
96    wallaby     1         0     0     1  ...     2     1         0        1     1
97       wasp     1         0     1     0  ...     6     0         0        0     6
98       wolf     1         0     0     1  ...     4     1         0        1     1
99       worm     0         0     1     0  ...     0     0         0        0     7
100      wren     0         1     1     0  ...     2     1         0        0     2

[101 rows x 18 columns]

In [ ]:
# animals = data.loc[:, ['name', 'hair', 'feathers']]과 같은 결과를 가진다.
df_animals3 = df_animals[['name', 'hair', 'feathers']]
df_animals3

         name  hair  feathers
0    aardvark     1         0
1    antelope     1         0
2        bass     0         0
3        bear     1         0
4        boar     1         0
..        ...   ...       ...
96    wallaby     1         0
97       wasp     1         0
98       wolf     1         0
99       worm     0         0
100      wren     0         1

[101 rows x 3 columns]

## HTML 파일 불러오기

**HTML**(hypertext markup language)이란?
- 웹페이지 문서를 작성하는 언어다.
- 확장자는 **.html**, **.htm**이다.
- 홑화살괄호 (**<  >**)로 구분되는 태그들로 구성되어 있는 파일 형식이다.

판다스(Pandas)에서는 HTML 문서에 있는 표(table) 데이터를 쉽게 불러올 수 있다.
- **read_html()** 메소드는 HTML문서에서 표(<**table**> 태그)에 해당하는 부분만 자동으로 읽어온다.
    + pandas.**read_html**(*url*)
    + pandas.**read_html**(*filepath*)
    + **[주의]** : **read_html()** 메소드는 데이터프레임을 담은 **리스트**를 반환한다.

[pandas.read_html](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_html.html)
- Read HTML tables into a list of DataFrame objects.
- pandas.**read_html**(*io, match='.+', flavor=None, header=None, index_col=None, skiprows=None, attrs=None, parse_dates=False, thousands=', ', encoding=None, decimal='.', converters=None, na_values=None, keep_default_na=True, displayed_only=True*)

In [ ]:
# 해당 url의 html 파일 중 태그가 <table>로 구성되어 있는 데이터를 가져온다.
# 이 때 read_html() 메소드는 데이터프레임을 담은 리스트를 반환한다.

url = 'https://www.basketball-reference.com/leagues/NBA_2019_totals.html'
list_of_dfs = pandas.read_html(url)
df = list_of_dfs[0]
df

      Rk        Player Pos Age   Tm   G  GS  ...  TRB  AST  STL BLK  TOV   PF   PTS
0      1  Álex Abrines  SG  25  OKC  31   2  ...   48   20   17   6   14   53   165
1      2    Quincy Acy  PF  28  PHO  10   0  ...   25    8    1   4    4   24    17
2      3  Jaylen Adams  PG  22  ATL  34   1  ...   60   65   14   5   28   45   108
3      4  Steven Adams   C  25  OKC  80  80  ...  760  124  117  76  135  204  1108
4      5   Bam Adebayo   C  21  MIA  82  28  ...  597  184   71  65  121  203   729
..   ...           ...  ..  ..  ...  ..  ..  ...  ...  ...  ...  ..  ...  ...   ...
729  528  Tyler Zeller   C  29  MEM   4   1  ...   18    3    1   3    4   16    46
730  529    Ante Žižić   C  22  CLE  59  25  ...  320   53   13  22   61  113   459
731  530   Ivica Zubac   C  21  TOT  59  37  ...  362   63   14  51   70  137   525
732  530   Ivica Zubac   C  21  LAL  33  12  ...  162   25    4  27   33   73   281
733  530   Ivica Zubac   C  21  LAC  26  25  ...  200   38   10  24   37   64   244

[734 rows x 30 columns]

In [ ]:
# 파일로 저장된 html 문서는 일반 파일처럼 파일 경로를 통해 해당 페이지의 <table> 내용을 가져온다.
# 가져올 html 파일은 'NBA_2019_totals.html'
list_of_dfs = pandas.read_html('NBA_2019_totals.html')
df = list_of_dfs[0]
df

      Rk        Player Pos Age   Tm   G  GS  ...  TRB  AST  STL BLK  TOV   PF   PTS
0      1  Álex Abrines  SG  25  OKC  31   2  ...   48   20   17   6   14   53   165
1      2    Quincy Acy  PF  28  PHO  10   0  ...   25    8    1   4    4   24    17
2      3  Jaylen Adams  PG  22  ATL  34   1  ...   60   65   14   5   28   45   108
3      4  Steven Adams   C  25  OKC  80  80  ...  760  124  117  76  135  204  1108
4      5   Bam Adebayo   C  21  MIA  82  28  ...  597  184   71  65  121  203   729
..   ...           ...  ..  ..  ...  ..  ..  ...  ...  ...  ...  ..  ...  ...   ...
729  528  Tyler Zeller   C  29  MEM   4   1  ...   18    3    1   3    4   16    46
730  529    Ante Žižić   C  22  CLE  59  25  ...  320   53   13  22   61  113   459
731  530   Ivica Zubac   C  21  TOT  59  37  ...  362   63   14  51   70  137   525
732  530   Ivica Zubac   C  21  LAL  33  12  ...  162   25    4  27   33   73   281
733  530   Ivica Zubac   C  21  LAC  26  25  ...  200   38   10  24   37   64   244

[734 rows x 30 columns]

## JSON 파일 불러오기

**JSON**(**J**ava**S**cript **O**bject **N**otation)이란?
- Lightweight data-interchange format
    + 사람이 읽을 수 있고 기계가 처리할 수 있는 경량 데이터 교환 형식이다.
    + 파이썬의 딕셔너리처럼 키:매핑값 형식으로 내용을 저장한다.
- 확장자는 **.json**이다. 
- 프로그래밍 언어와 플랫폼에 독립적이라 많은 응용 프로그램에서 데이터 교환용으로 많이 사용한다.
    + 특히 웹에서 데이터를 주고 받을 때 자주 사용하는 파일 형식이다.
- 추가 정보 : http://json.org

**json** 형식은 파이썬의 딕셔너리와 유사하다. 하지만 트리(tree) 구조로 이해를 하는 것이 좀더 직관적이다.
- <https://www.sitepoint.com/demos/online-json-tree-viewer/>를 이용하면
- JSON 파일을 트리구조로 시각화 할 수 있다.

판다스(Pandas)에서는 JSON 파일도 쉽게 불러올 수 있다.
- **read_json()** 메소드를 통해 데이터를 불러오면 자동으로 데이터프레임으로 저장된다.
    + pandas.**read_json**(*url*)
    + pandas.**read_json**(*filepath*)

[pandas.read_json](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_json.html)
- Convert a JSON string to pandas object.
- pandas.**read_json**(*path_or_buf=None, orient=None, typ='frame', dtype=None, convert_axes=None, convert_dates=True, keep_default_dates=True, numpy=False, precise_float=False, date_unit=None, encoding=None, lines=False, chunksize=None, compression='infer'*)

In [ ]:
# 해당 url의 json 파일을 가져온다.
url = 'https://api.coindesk.com/v1/bpi/currentprice/KRW.json' 
df = pandas.read_json(url)
df

                                 time  ...                                                bpi
updated     Jul 25, 2020 13:00:00 UTC  ...                                                NaN
updatedISO  2020-07-25T13:00:00+00:00  ...                                                NaN
updateduk   Jul 25, 2020 at 14:00 BST  ...                                                NaN
USD                               NaN  ...  {'code': 'USD', 'rate': '9,624.5054', 'descrip...
KRW                               NaN  ...  {'code': 'KRW', 'rate': '11,564,709.0904', 'de...

[5 rows x 3 columns]

In [ ]:
# 파일로 저장된 json 문서는 일반 파일처럼 파일 경로를 통해 json 파일을 가져온다.
# 가져올 json 파일은 'bitcoin_price.json'
df = pandas.read_json('bitcoin_price.json')
df

                                 time  ...                                                bpi
updated      Apr 2, 2020 10:44:00 UTC  ...                                                NaN
updatedISO  2020-04-02T10:44:00+00:00  ...                                                NaN
updateduk    Apr 2, 2020 at 11:44 BST  ...                                                NaN
USD                               NaN  ...  {'code': 'USD', 'rate': '6,663.3517', 'descrip...
KRW                               NaN  ...  {'code': 'KRW', 'rate': '8,189,592.6911', 'des...

[5 rows x 3 columns]

[pandas.json_normalize](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.json_normalize.html)
- Normalize semi-structured JSON data into a flat table.
- pandas.**json_normalize**(*data: Union[Dict, List[Dict]], record_path: Union[str, List, NoneType]=None, meta: Union[str, List[Union[str, List[str]]], NoneType]=None, meta_prefix: Union[str, NoneType]=None, record_prefix: Union[str, NoneType]=None, errors: Union[str, NoneType]='raise', sep: str='.', max_level: Union[int, NoneType]=None*)

In [ ]:
# json_normalize() 함수를 이용하여 중첩 구조의 json 파일을 평평한 테이블(flat table) 형식으로 변환한다.
# 가져올 json 파일은 'bitcoin_price.json'
import json
# file = open('bitcoin_price.json')  # 파일은 연다.
# data = json.load(file)                  # 파일을 json으로 불러온다.
# df = pandas.json_normalize(data)        # 중첩 json 파일 구조를 단순한 테이블 형식으로 정규화한다.
df = pandas.json_normalize(json.load(open('bitcoin_price.json')))
df

                                          disclaimer  ... bpi.KRW.rate_float
0  This data was produced from the CoinDesk Bitco...  ...       8.189593e+06

[1 rows x 12 columns]

## 클립보드 내용 불러오기

[pandas.read_clipboard](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_clipboard.html)
- Read text from clipboard and pass to read_csv.
- pandas.**read_clipboard**(*sep='\s+', **kwargs*)
    + ***sep*** : *str, default ‘s+’*
        - A string or regex delimiter. The default of ‘s+’ denotes one or more whitespace characters.
    + *****kwargs*** : See **read_csv** for the full argument list.

## 데이터 저장하기

판다스(Pandas)를 활용하면 csv 혹은 엑셀(excel) 형태의 데이터로 저장하는 것도 용이하다.
- **to_csv()**와 **to_excel()** 메소드를 사용한다.

[pandas.DataFrame.to_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html#pandas.DataFrame.to_csv)
- Write object to a comma-separated values (csv) file.
- DataFrame.**to_csv**(*self, path_or_buf=None, sep=', ', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, mode='w', encoding=None, compression='infer', quoting=None, quotechar='"', line_terminator=None, chunksize=None, date_format=None, doublequote=True, escapechar=None, decimal='.'*)

[pandas.DataFrame.to_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_excel.html#pandas.DataFrame.to_excel)
- Write object to an Excel sheet.
- To write a single object to an Excel .xlsx file it is only necessary to specify a target file name. To write to multiple sheets it is necessary to create an *ExcelWriter* object with a target file name, and specify a sheet in the file to write to.
- Multiple sheets may be written to by specifying unique *sheet_name*. With all data written to the file, it is necessary to save the changes. Note that creating an *ExcelWriter* object with a file name that already exists will result in the contents of the existing file being erased.
- DataFrame.**to_excel**(*self, excel_writer, sheet_name='Sheet1', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, startrow=0, startcol=0, engine=None, merge_cells=True, encoding=None, inf_rep='inf', verbose=True, freeze_panes=None*)

In [ ]:
df = pandas.read_csv('csv_data.csv')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [ ]:
# 앞서 데이터프레임으로 읽어 들인 df를 CSV 파일 형식으로 저장한다.
# 매개변수 sep를 설정하지 않으면 기본값인 쉼표를 구분자로 하여 파일을 저장한다.
df.to_csv('data.csv')  
# df.to_csv('data.csv', sep = ',') 와 같다.

In [ ]:
# 파일이 잘 저장되었는지 확인한다.
%pycat data.csv

In [ ]:
# --- 로컬 파일로 내려받기를 한다.
from google.colab import files
files.download('data.csv')

엑셀 파일을 읽고 쓰려면 [openpyxl](https://openpyxl.readthedocs.io/en/stable/) 모듈을 설치해야 한다.

In [ ]:
# 엑셀 파일을 읽고 쓰려면 openpyxl 모듈을 설치해야 한다.
# Google Colab에는 이미 설치가 되어 있다.
# !pip install --upgrade openpyxl

In [ ]:
# 앞서 데이터프레임으로 읽어 들인 df를 엑셀 파일 형식으로 저장한다.
# 매개변수 sheet_name을 설정하면 sheet의 이름을 지정하고 저장할 수 있다.
df.to_excel('data.xlsx', sheet_name='Members')

**실행 결과** : 파일을 성공적으로 저장하면(즉, 오류가 안 나면) 결과는 출력하지 않는다.

In [ ]:
# --- 로컬 파일로 내려받기를 한다.
from google.colab import files
files.download('data.xlsx')

### Lab: 데이터프레임을 엑셀 파일로 저장하기

---

- 앞서 < Lab: 엑셀 파일을 데이터프레임으로 불러오기 >에서 만든 데이터프레임의 데이터를 하위 폴더 **data**에 엑셀 파일로 저장한다.
- 저장할 파일 이름은 'animals_sub.xlsx'로 한다.

---

In [ ]:
df_animals3.to_excel('animals_sub.xlsx', sheet_name='Animals')

In [ ]:
# --- 로컬 파일로 내려받기를 한다.
from google.colab import files
files.download('animals_sub.xlsx')

# 데이터프레임 열람

In [ ]:
n = 4, 0, 3, 0, 2, 5, 3, 0, 1, 2
integers = 73, -29, 85, -32, 97, 11, 55, -78, 49, 61
floats = 0.35,  0.12,  0.71, -0.09, -1.21, 1.32, -0.65, 0.34, -1.23, -0.79
grades = list('AAABBb') + [numpy.nan] + list('CAB')

df = pandas.DataFrame({'A': integers,
                       'B': floats,
                       'C': n,
                       'D': pandas.Categorical(grades),
                       'E': pandas.date_range('2050-4-10', periods=10)},
                      index=list('abcdefghij'))
df

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

**<font size='+1'>인덱스와 열 제목 열람 </font>**

인덱스(행)과 열(컬럼)의 정보만 열람이 가능한다.

[pandas.DataFrame.index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html#pandas.DataFrame.index)
- The index (row labels) of the DataFrame.
- DataFrame.**index**

[pandas.DataFrame.columns](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html#pandas.DataFrame.columns)
- The column labels of the DataFrame.
- DataFrame.**columns**

In [ ]:
# 인덱스 정보를 열람한다.
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [ ]:
# 열 이름 정보를 열람한다.
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

**<font size='+1'>부분 열람 </font>**

**head()**와 **tail()** 메소드
- **head()**와 **tail()** 메소드로 데이터의 일부만 열람할 수 있다.
- 전달인자가 없으면 기본값인 상위 혹은 하위 **5**개의 데이터만 보여준다.

[pandas.DataFrame.head](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html#pandas.DataFrame.head)
- Return the first n rows.
- DataFrame.**head**(*n=5*)

[pandas.DataFrame.tail](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html#pandas.DataFrame.tail)
- Return the last n rows.
- DataFrame.**tail**(*n=5*)

In [ ]:
# 첫 2행만 보여준다.
df.head(2)

    A     B  C  D          E
a  73  0.35  4  A 2050-04-10
b -29  0.12  0  A 2050-04-11

In [ ]:
# 마지막 5행만 보여준다.
df.tail()

    A     B  C    D          E
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# 마지막 2행만 제외하고 모두 보여준다.
df.head(-2)

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17

In [ ]:
# 첫 3행만 제외하고 모두 보여준다.
df.tail(-3)

    A     B  C    D          E
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

**<font size='+1'>셀 데이터 열람 </font>**

데이터프레임 내의 값들만 열람 할 수 있다.
-  인덱스와 열 제목은 포함하지 않는다.

[pandas.DataFrame.values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.values.html#pandas.DataFrame.values)
- Return a Numpy representation of the DataFrame.
- DataFrame.**values**

In [ ]:
# 모든 셀의 데이터를 열람한다.
df.values

array([[73, 0.35, 4, 'A', Timestamp('2050-04-10 00:00:00')],
       [-29, 0.12, 0, 'A', Timestamp('2050-04-11 00:00:00')],
       [85, 0.71, 3, 'A', Timestamp('2050-04-12 00:00:00')],
       [-32, -0.09, 0, 'B', Timestamp('2050-04-13 00:00:00')],
       [97, -1.21, 2, 'B', Timestamp('2050-04-14 00:00:00')],
       [11, 1.32, 5, 'b', Timestamp('2050-04-15 00:00:00')],
       [55, -0.65, 3, nan, Timestamp('2050-04-16 00:00:00')],
       [-78, 0.34, 0, 'C', Timestamp('2050-04-17 00:00:00')],
       [49, -1.23, 1, 'A', Timestamp('2050-04-18 00:00:00')],
       [61, -0.79, 2, 'B', Timestamp('2050-04-19 00:00:00')]],
      dtype=object)

하지만 추천하는 방식은 **to_numpy()** 메소드를 사용하는 것이다.

[pandas.DataFrame.to_numpy](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy)
- Convert the DataFrame to a NumPy array
- DataFrame.**to_numpy**(*dtype=None, copy=False*)

In [ ]:
# 모든 셀의 데이터를 열람한다.
df.to_numpy()

array([[73, 0.35, 4, 'A', Timestamp('2050-04-10 00:00:00')],
       [-29, 0.12, 0, 'A', Timestamp('2050-04-11 00:00:00')],
       [85, 0.71, 3, 'A', Timestamp('2050-04-12 00:00:00')],
       [-32, -0.09, 0, 'B', Timestamp('2050-04-13 00:00:00')],
       [97, -1.21, 2, 'B', Timestamp('2050-04-14 00:00:00')],
       [11, 1.32, 5, 'b', Timestamp('2050-04-15 00:00:00')],
       [55, -0.65, 3, nan, Timestamp('2050-04-16 00:00:00')],
       [-78, 0.34, 0, 'C', Timestamp('2050-04-17 00:00:00')],
       [49, -1.23, 1, 'A', Timestamp('2050-04-18 00:00:00')],
       [61, -0.79, 2, 'B', Timestamp('2050-04-19 00:00:00')]],
      dtype=object)

**<font size='+1'>열(컬럼) 데이터 열람 </font>**

**단일 열** : 열 이름을 넣어 특정 단일 열의 데이터만 열람이 가능하다.
- DataFrame[**'열이름'**] 또는 DataFrame.**열이름**
- pandas.**Series**로 결과를 반환한다.

In [ ]:
# --- 'A' 열의 데이터만 열람한다.
x = df['A'] # df.A와 같다. 
print(x)

# 자료형을 확인한다.
type(x)

a    73
b   -29
c    85
d   -32
e    97
f    11
g    55
h   -78
i    49
j    61
Name: A, dtype: int64

pandas.core.series.Series

**복수 열** : 한 개 이상의 열 이름을 넣어 지정한 열의 데이터만 열람이 가능하다.
- DataFrame[**['열이름', '열이름', ...]**]
- **pandas.DataFrame**으로 결과를 반환한다.

In [ ]:
# --- 'C'와 'A' 열의 데이터만 열람한다.
# NumPy의 배열 인덱싱과 유사하다.
# df.loc[:, ['C', 'A']] 또는 df.iloc[:, 2::-2]과 같은 결과를 가진다.
y = df[['C', 'A']]  # df.C, df.A외는 다르다.
y

   C   A
a  4  73
b  0 -29
c  3  85
d  0 -32
e  2  97
f  5  11
g  3  55
h  0 -78
i  1  49
j  2  61

In [ ]:
# 자료형을 확인한다.
type(y)

pandas.core.frame.DataFrame

**<font size='+1'>Lab: 데이터프레임에서 열 데이터 열람 </font>**

---

- 앞서 < Lab: 데이터프레임 구성하기 >에서 만든 데이터프레임에서 'Title' 컬럼의 데이터만 열람해서 추출한다.
- 추출한 데이터는 모두 소문자(lowercase)로 변환한 뒤 리스트 형식으로 변수에 할당한 후 출력한다.

---

**실행 예**

<pre>['skyfall',
 'lose yourself',
 'another brick in the wall',
 'use somebody',
 'treasure']</pre>

In [ ]:
# title = ['Skyfall', 'Lose Yourself', 'Another Brick in the Wall', 'Use Somebody', 'Treasure']
# artist = ['Adele', 'Eminem', 'Pink Floyd', 'Kings of Leon', 'Bruno Mars']
# length = ['4:46', '5:26', '3:59', '3:51', '2:58']
# year = [2012, 2002, 1979, 2008, 2013]

# df_movies = pandas.DataFrame({
#     'Title': title, 
#     'Artist': artist, 
#     'Length': length, 
#     'Year': year})

In [ ]:
title_lowercase = []
for t in df_movies['Title']:
    title_lowercase.append(t.lower())

title_lowercase

['skyfall',
 'lose yourself',
 'another brick in the wall',
 'use somebody',
 'treasure']

In [ ]:
title_lowercase = [t.lower() for t in df_movies['Title']]
title_lowercase

['skyfall',
 'lose yourself',
 'another brick in the wall',
 'use somebody',
 'treasure']

**<font size='+1'>행 데이터 열람 </font>**

분할 연산자 **[::]** 를 통해 열을 기준으로 일부 또는 전체 데이터를 열람할 수 있다.
- DataFrame[**시작:끝:폭**]

**[참고]**  
- 분할 연산 시 **숫자**를 사용하면 파이썬의 분할 연산처럼 **[시작:끝]**에서 **끝** 값은 포함하지 않는다.
- 분할 연산 시 **인덱스 이름**을 사용하면 **[시작:끝]**에서 **끝** 값도 포함한다.

In [ ]:
# 분할 연산자를 사용하여 전체 행 데이터를 열람한다.
df[:]  # >>> df와 같다.

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# 첫 5개 행 데이터를 열람한다.
df[:5]  # >>> df.head()와 같다.

    A     B  C  D          E
a  73  0.35  4  A 2050-04-10
b -29  0.12  0  A 2050-04-11
c  85  0.71  3  A 2050-04-12
d -32 -0.09  0  B 2050-04-13
e  97 -1.21  2  B 2050-04-14

In [ ]:
# 짝수 행 데이터만 열람한다.
df[1::2]

    A     B  C  D          E
b -29  0.12  0  A 2050-04-11
d -32 -0.09  0  B 2050-04-13
f  11  1.32  5  b 2050-04-15
h -78  0.34  0  C 2050-04-17
j  61 -0.79  2  B 2050-04-19

In [ ]:
# --- 인덱스로 행 데이터를 열람한다. 
# 첫 5개 행 데이터를 열람한다. 
# 파이썬 분할 연산과 달리 끝(end)도 포함한다.
df[:'e']  # df[:5]와 같다.

    A     B  C  D          E
a  73  0.35  4  A 2050-04-10
b -29  0.12  0  A 2050-04-11
c  85  0.71  3  A 2050-04-12
d -32 -0.09  0  B 2050-04-13
e  97 -1.21  2  B 2050-04-14

In [ ]:
# --- 인덱스로 행 데이터를 열람한다. 
# 홀수 행 데이터만 열람한다.
df['a'::2]  # df[::2]

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
c  85  0.71  3    A 2050-04-12
e  97 -1.21  2    B 2050-04-14
g  55 -0.65  3  NaN 2050-04-16
i  49 -1.23  1    A 2050-04-18

**<font size='+1'>행과 열 데이터 열람 </font>**

**Selection by Label: loc[]**
- 행과 열의 이름으로 데이터를 열람한다.
- DataFrame.**loc[인덱스[, 열이름]]**
    + ***인덱스*** 와 ***열이름*** 의 범위에 해당하는 데이터프레임을 반환한다.

[pandas.DataFrame.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc)
- Access a group of rows and columns by label(s) or a boolean array.
- DataFrame.**loc**

**[참고]**
- 판다스 **loc**에서 활용할때는 **[시작:끝]**에서 **끝** 값도 포함한다.

In [ ]:
# 인덱스 'e' 행의 데이터를 열람한다.
df.loc['e']

A                     97
B                  -1.21
C                      2
D                      B
E    2050-04-14 00:00:00
Name: e, dtype: object

In [ ]:
# 인덱스 'e', 'f', 'g' 행의 데이터를 열람한다.
# 파이썬 분할 연산과는 달리 끝(end)도 포함한다.
df.loc['e':'g']

    A     B  C    D          E
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16

In [ ]:
# --- 지정한 행과 지정한 열의 데이터를 열람한다.
# 인덱스 'a', 'c', 'i', 'j' 행의 'A', 'B', 'C' 열 데이터를 열람한다.
df.loc[['a', 'c', 'i', 'j'], :'C']

    A     B  C
a  73  0.35  4
c  85  0.71  3
i  49 -1.23  1
j  61 -0.79  2

In [ ]:
# --- 지정한 행과 지정한 열의 데이터를 열람한다.
# 인덱스 'j' 행부터 거꾸로 하나씩 건너 뛰면서 'C'와 'B' 열 데이터를 열람한다.
df.loc['j'::-2, ['C', 'B']]

   C     B
j  2 -0.79
h  0  0.34
f  5  1.32
d  0 -0.09
b  0  0.12

In [ ]:
# --- 지정한 행과 지정한 열의 데이터를 열람한다.
# 인덱스 'f' 행 'B' 열의 데이터를 열람한다.
df.loc['f', 'B']

1.32

**Selection by Position: iloc[]**
- 정수 인덱스로 데이터를 열람한다.
정수 인덱스로 데이터를 열람한다.
- DataFrame.**iloc[행번호[, 열번호]]**
    + ***행번호*** 와 ***열번호*** 의 범위에 해당하는 데이터프레임을 반환한다.

[pandas.DataFrame.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc)
- Purely integer-location based indexing for selection by position.
- DataFrame.**iloc**

**[참고]**
- 파이썬의 분할 연산처럼 **[시작:끝]**에서 **끝** 값은 포함하지 않는다.

In [ ]:
# 첫 번째 행의 데이터를 열람한다.
df.iloc[0]

A                     73
B                   0.35
C                      4
D                      A
E    2050-04-10 00:00:00
Name: a, dtype: object

In [ ]:
# 첫 두 행의 데이터를 열람한다.
df.iloc[:2]

    A     B  C  D          E
a  73  0.35  4  A 2050-04-10
b -29  0.12  0  A 2050-04-11

In [ ]:
# 마지막 행의 첫 세 열의 데이터를 열람한다.
df.iloc[-1, :3]

A      61
B   -0.79
C       2
Name: j, dtype: object

In [ ]:
# --- 지정한 행과 지정한 열의 데이터를 열람한다.
# 9번째 행부터 100번째 행(10행뿐임)에서 
# 마지막과 세 번째, 첫 번째 열의 데이터를 열람한다. 
df.iloc[8:100, ::-2]

           E  C   A
i 2050-04-18  1  49
j 2050-04-19  2  61

In [ ]:
# --- 지정한 행과 지정한 열의 데이터를 열람한다.
# 5번째, 8번째, 마지막 행에서 첫 번째, 
# 세 번째 열의 데이터를 열람한다.
df.iloc[[4, 7, -1], [0, 2]]

    A  C
e  97  2
h -78  0
j  61  2

**특정 조건으로 열람 : 불린 인덱싱**
- SQL의 **SELCT…FROM…WHERE** 구문과 유사하다.
- **SELECT** 프로젝션(projection)과 **WHERE** 조건문 사용

In [ ]:
# SELECT *
#   FROM df 
#  WHERE A < 0

# 'A' 열의 값이 음수인 행을 열람한다.
df[df['A'] < 0]  # df[df.A < 0]와 같다.

    A     B  C  D          E
b -29  0.12  0  A 2050-04-11
d -32 -0.09  0  B 2050-04-13
h -78  0.34  0  C 2050-04-17

In [ ]:
# SELECT * 
#   FROM df 
#  WHERE A > 0 AND B < 0

# 'A'열의 값이 양수이면서 'B' 열의 값이 음수인 행을 열람한다.
# AND는 '&'를 사용한다.
df[(df.A > 0) & (df.B < 0)]  # 반드시 괄호로 묶어야 한다.

    A     B  C    D          E
e  97 -1.21  2    B 2050-04-14
g  55 -0.65  3  NaN 2050-04-16
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# SELECT * 
#   FROM df 
#  WHERE B > 1 OR A <= -1

# 'B'열의 값이 1보다 크거나 'A' 열의 값이 -50보다 작은 행을 열람한다.
# OR는 '|'를 사용한다.
df[(df['B'] > 1) | (df.A <= -50)]  # 반드시 괄호로 묶어야 한다.

    A     B  C  D          E
f  11  1.32  5  b 2050-04-15
h -78  0.34  0  C 2050-04-17

In [ ]:
# --- 전체 데이터에서 조건을 만족하는 셀을 열람한다.
# 먼저 숫치로만 이루어진 데이터프레임을 생성한다.
df2 = pandas.DataFrame(numpy.random.randn(10, 3),  # shape of (10, 3)
                       index=list('abcdefghij'), 
                       columns=list('ABC'))

In [ ]:
# df2 전체 데이터에서 0보다 큰 값을 가진 조건을 만족하는 셀을 열람한다.
df2[df2 > 0]

          A         B         C
a       NaN       NaN       NaN
b       NaN       NaN  1.287834
c       NaN       NaN       NaN
d  0.496370  0.483042  0.700012
e  0.386662       NaN       NaN
f       NaN       NaN  0.191709
g  1.115696  0.553788  0.029950
h  0.722985       NaN       NaN
i  0.795368       NaN  0.760775
j  0.145489  0.500949       NaN

**isin()** 메소드 
- 지정한 값을 가진 데이터만 열람한다.

[pandas.DataFrame.isin](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html#pandas.DataFrame.isin)
- Whether each element in the DataFrame is contained in values.
- DataFrame.**isin**(*self, values*)
    - **values** : *iterable*, *Series*, *DataFrame* or *dict*

In [ ]:
# C 열에서 1 또는 3을 포한한 데이터만 열람한다.
df[df['C'].isin([1, 3])]  # df[df.C.isin([1, 3])]과 같다.

# --- 튜플을 사용해도 된다.
# df[df.C.isin((1, 3))]

    A     B  C    D          E
c  85  0.71  3    A 2050-04-12
g  55 -0.65  3  NaN 2050-04-16
i  49 -1.23  1    A 2050-04-18

In [ ]:
# 전체 데이터에서 값이 'A' 또는 0인 셀을 불린 표현으로 열람한다.
df.isin(['A', 0])

       A      B      C      D      E
a  False  False  False   True  False
b  False  False   True   True  False
c  False  False  False   True  False
d  False  False   True  False  False
e  False  False  False  False  False
f  False  False  False  False  False
g  False  False  False  False  False
h  False  False   True  False  False
i  False  False  False   True  False
j  False  False  False  False  False

**isna()** 메소드
- 데이터 값이 결측치(NaN)가 있는 셀을 불린 표현으로 열람한다.

[pandas.isna](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isna.html#pandas.isna)
- Detect missing values for an array-like object.
- This function takes a scalar or array-like object and indicates whether values are missing (NaN in numeric arrays, None or NaN in object arrays, NaT in datetimelike)
- pandas.**isna**(*obj*)

**[참고]**  
NaN(Not a Number)은 정의할 수 없는 숫자를 나타내는 말로서 
1. 연산을 수행후 그 결과 값을 숫자로 표현할 수 없는 실수(float) 값 또는
1. 판다스에서 결측치(missing data)를 의미할 때 사용한다.

In [ ]:
# 전체 데이터에서 결측치가 있는 셀을 불린 표현으로 열람한다.
pandas.isna(df)

       A      B      C      D      E
a  False  False  False  False  False
b  False  False  False  False  False
c  False  False  False  False  False
d  False  False  False  False  False
e  False  False  False  False  False
f  False  False  False  False  False
g  False  False  False   True  False
h  False  False  False  False  False
i  False  False  False  False  False
j  False  False  False  False  False

**<font size='+1'>특정 셀 데이터 열람 </font>**

**Selection by Label: at[]**
- 행과 열의 이름으로 특정 셀의 데이터를 열람한다.

[pandas.DataFrame.at](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html#pandas.DataFrame.at)
- Access a single value for a row/column label pair.
- DataFrame.**at**

In [ ]:
df

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# 인덱스 'f' 행의 'B' 열 데이터를 열람한다.
df.at['f', 'B']

1.32

**Selection by Position: iat[]**
- 정수 인덱스로 특정 셀의 데이터를 열람한다.

[pandas.DataFrame.iat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iat.html#pandas.DataFrame.iat)
- Access a single value for a row/column pair by integer position.
- DataFrame.**iat**

In [ ]:
df

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# 마지막 열의 첫 번째 행 데이터를 열람한다.
df.iat[-1, 0]

61

**<font size='+1'>정렬(sorting)</font>**
- 열 혹은 행 기준으로 데이터를 정렬할 수 있다.

[pandas.DataFrame.sort_values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values)
- Sort by the values along either axis.
- DataFrame.**sort_values**(*by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last'*)
    - ***by*** : *str* or *list of str*
        - Name or list of names to sort by.
        - if *axis* is 0 or *'index'* then **by** may contain index levels and/or column labels
        - if *axis* is 1 or *'columns'* then **by** may contain column levels and/or index labels
    - ***axis*** : {0 or *'index'*, 1 or *'columns'*}, default 0
        - Axis to be sorted

In [ ]:
# 'A'열의 값을 기준으로 오름차순 정렬한다.
df.sort_values(by='A')

    A     B  C    D          E
h -78  0.34  0    C 2050-04-17
d -32 -0.09  0    B 2050-04-13
b -29  0.12  0    A 2050-04-11
f  11  1.32  5    b 2050-04-15
i  49 -1.23  1    A 2050-04-18
g  55 -0.65  3  NaN 2050-04-16
j  61 -0.79  2    B 2050-04-19
a  73  0.35  4    A 2050-04-10
c  85  0.71  3    A 2050-04-12
e  97 -1.21  2    B 2050-04-14

In [ ]:
# 'B'열의 값을 기준으로 오름차순 정렬한다.
# 매개변수 by의 값이 첫 전달인자로 오면 by는 생략이 가능하다.
df.sort_values('B', ascending=False)

    A     B  C    D          E
f  11  1.32  5    b 2050-04-15
c  85  0.71  3    A 2050-04-12
a  73  0.35  4    A 2050-04-10
h -78  0.34  0    C 2050-04-17
b -29  0.12  0    A 2050-04-11
d -32 -0.09  0    B 2050-04-13
g  55 -0.65  3  NaN 2050-04-16
j  61 -0.79  2    B 2050-04-19
e  97 -1.21  2    B 2050-04-14
i  49 -1.23  1    A 2050-04-18

In [ ]:
# 'D' 열과 'E' 열의 값을 기준으로 오름차순 정렬한다.
df.sort_values(by=['D', 'E'])

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
i  49 -1.23  1    A 2050-04-18
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
j  61 -0.79  2    B 2050-04-19
h -78  0.34  0    C 2050-04-17
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16

In [ ]:
# 'D' 열의 값을 기준으로 오름차순 정렬한다.
# 이 때 결측치 값을 맨 위쪽으로 위치시킨다.
df.sort_values(by=['D'], 
               na_position='first')

    A     B  C    D          E
g  55 -0.65  3  NaN 2050-04-16
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
i  49 -1.23  1    A 2050-04-18
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
j  61 -0.79  2    B 2050-04-19
h -78  0.34  0    C 2050-04-17
f  11  1.32  5    b 2050-04-15

**<font size='+1'>전치(transpose)</font>**
- 행과 열을 바꾸어 열람할 수 있다.

[pandas.DataFrame.T](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.T.html#pandas.DataFrame.T)
- Transpose index and columns.
- DataFrame.**T**

In [ ]:
df

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

In [ ]:
# 행과 열을 바꾸어 열람한다.
df.T

                     a  ...                    j
A                   73  ...                   61
B                 0.35  ...                -0.79
C                    4  ...                    2
D                    A  ...                    B
E  2050-04-10 00:00:00  ...  2050-04-19 00:00:00

[5 rows x 10 columns]

**<font size='+1'>데이터 요약 정보 열람</font>**
- **describe()** 메소드로 데이터의 요약(수치형인 경우 기술통계량)을 열람할 수 있다.

[pandas.DataFrame.describe](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html#pandas.DataFrame.describe)
- Generate descriptive statistics that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.
- Analyzes both numeric and object series, as well as **DataFrame** column sets of mixed data types. The output will vary depending on what is provided. Refer to the notes below for more detail.
- DataFrame.**describe**(*self, percentiles=None, include=None, exclude=None*)

In [ ]:
# 전체 데이터의 기술통계량을 열람한다.
df.describe()

               A          B          C
count  10.000000  10.000000  10.000000
mean   29.200000  -0.113000   2.000000
std    58.360565   0.843472   1.763834
min   -78.000000  -1.230000   0.000000
25%   -19.000000  -0.755000   0.250000
50%    52.000000   0.015000   2.000000
75%    70.000000   0.347500   3.000000
max    97.000000   1.320000   5.000000

In [ ]:
# --- 특정 열의 기술통계량을 열람한다.
# 'B' 열의 기술통계량을 열람한다.
df['B'].describe()

count    10.000000
mean     -0.113000
std       0.843472
min      -1.230000
25%      -0.755000
50%       0.015000
75%       0.347500
max       1.320000
Name: B, dtype: float64

In [ ]:
# --- 수치 데이터가 없는 특정 열의 기술통계량을 열람한다.
# 'D' 열의 기술통계량을 열람한다. 
df.D.describe()

count     9
unique    4
top       A
freq      4
Name: D, dtype: object

In [ ]:
# --- 일부(2개 이상) 열의 기술통계량을 열람한다.
# 'B'와 'A' 열의 기술통계량을 열람한다.
df[['B', 'A']].describe()

               B          A
count  10.000000  10.000000
mean   -0.113000  29.200000
std     0.843472  58.360565
min    -1.230000 -78.000000
25%    -0.755000 -19.000000
50%     0.015000  52.000000
75%     0.347500  70.000000
max     1.320000  97.000000

In [ ]:
# --- 특정 행의 기술통계량을 열람한다.
# 인덱스 'j' 행의 기술통계량을 열람한다.
df.loc['j'].describe()

count      5
unique     5
top       61
freq       1
Name: j, dtype: int64

In [ ]:
# --- 일부(2개 이상) 행의 일부 열의 기술통계량을 열람한다.
# 백분위 수를 50%만 하고 첫 5개 행의 'A', 'B' 열의 기술통계량을 열람한다.
df.iloc[:5, :2].describe(percentiles=[])  # percentiles=[.5]와 같다.

               A         B
count   5.000000  5.000000
mean   38.800000 -0.024000
std    63.837293  0.726347
min   -32.000000 -1.210000
50%    73.000000  0.120000
max    97.000000  0.710000

# 데이터프레임 인덱스

In [ ]:
n = 4, 0, 3, 0, 2, 5, 3, 0, 1, 2
integers = 73, -29, 85, -32, 97, 11, 55, -78, 49, 61
floats = 0.35,  0.12,  0.71, -0.09, -1.21, 1.32, -0.65, 0.34, -1.23, -0.79
grades = list('AAABBb') + [numpy.nan] + list('CAB')

df = pandas.DataFrame({'A': integers,
                       'B': floats,
                       'C': n,
                       'D': pandas.Categorical(grades),
                       'E': pandas.date_range('2050-4-10', periods=10)},
                      index=list('abcdefghij'))
df

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

**<font size='+1'>set_index() 메소드</font>**

하나 이상의 열 또는 배열을 인덱스로 설정한다.
- 특정 열 한 개 또는 여러 개를 인덱스로 지정하거나 
- 리스트나 배열을 인덱스로 지정할 때 사용한다.
- 중복 값이 없어야 한다. 중복 값이 있다고 해도 오류는 나지 않는다.
- 데이터프레임 자체의 원래 인덱스를 바꾸려면 **inplace=True**로 설정해야 한다.

[pandas.DataFrame.set_index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.set_index.html#pandas.DataFrame.set_index)
- Set the DataFrame index (row labels) using one or more existing columns or arrays (of the correct length). The index can replace the existing index or expand on it.
- DataFrame.**set_index**(*self, keys, drop=True, append=False, inplace=False, verify_integrity=False*)
    - **Parameters**
        - ***keys*** : *label* or *array-like* or *list of labels/arrays*
            - This parameter can be either a single column key, a single array of the same length as the calling DataFrame, or a list containing an arbitrary combination of column keys and arrays. Here, “array” encompasses **Series**, **Index**, **numpy.ndarray**, and instances of **Iterator**.
        - ***drop*** : *bool*, default True
            - Delete columns to be used as the new index.
        - ***append*** : *bool*, default False
            - Whether to append columns to existing index.
        - ***inplace*** : *bool*, default False
            - Modify the DataFrame in place (do not create a new object).
        - ***verify_integrity*** : *bool*, *default False*
            - Check the new index for duplicates. Otherwise defer the check until necessary. Setting to False will improve the performance of this method.     
    - **Returns**
        - *DataFrame* : Changed row labels.

In [ ]:
# 기존 열 'E'를 인덱스로 지정한다.
df.set_index('E')

             A     B  C    D
E
2050-04-10  73  0.35  4    A
2050-04-11 -29  0.12  0    A
2050-04-12  85  0.71  3    A
2050-04-13 -32 -0.09  0    B
2050-04-14  97 -1.21  2    B
2050-04-15  11  1.32  5    b
2050-04-16  55 -0.65  3  NaN
2050-04-17 -78  0.34  0    C
2050-04-18  49 -1.23  1    A
2050-04-19  61 -0.79  2    B

In [ ]:
# 새로운 인덱스와 기존 열을 인덱스로 지정한다.
idx = pandas.Index(list(range(len(df.index))))
df.set_index([idx, 'C'])

      A     B    D          E
  C
0 4  73  0.35    A 2050-04-10
1 0 -29  0.12    A 2050-04-11
2 3  85  0.71    A 2050-04-12
3 0 -32 -0.09    B 2050-04-13
4 2  97 -1.21    B 2050-04-14
5 5  11  1.32    b 2050-04-15
6 3  55 -0.65  NaN 2050-04-16
7 0 -78  0.34    C 2050-04-17
8 1  49 -1.23    A 2050-04-18
9 2  61 -0.79    B 2050-04-19

In [ ]:
# 기존 열 두 개를 인덱스로 지정한다.
df.set_index(['E', 'A'])

                   B  C    D
E          A
2050-04-10  73  0.35  4    A
2050-04-11 -29  0.12  0    A
2050-04-12  85  0.71  3    A
2050-04-13 -32 -0.09  0    B
2050-04-14  97 -1.21  2    B
2050-04-15  11  1.32  5    b
2050-04-16  55 -0.65  3  NaN
2050-04-17 -78  0.34  0    C
2050-04-18  49 -1.23  1    A
2050-04-19  61 -0.79  2    B

In [ ]:
df  # 원본 데이터프레임은 그대로다.

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

**<font size='+1'>reset_index() 메소드</font>**

인덱스를 기본값 상태로 바꾼다.
- 데이터프레임 자체의 원래 인덱스를 바꾸려면 **inplace=True**로 설정해야 한다.

[pandas.DataFrame.reset_index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html#pandas.DataFrame.reset_index)
- Reset the index, or a level of it.
- Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.
- DataFrame.**reset_index**(*self, level=None, drop=False, inplace=False, col_level=0, col_fill=''*)
    - **Parameters**
        - ***level*** : *int*, *str*, *tuple*, or *list*, default None
            - Only remove the given levels from the index. Removes all levels by default.
        - ***drop*** : *bool*, default False
            - Do not try to insert index into dataframe columns. This resets the index to the default integer index.
        - ***inplace*** : *bool*, default False
            - Modify the DataFrame in place (do not create a new object).
        - ***col_level*** : *int* or *str*, default 0
            - If the columns have multiple levels, determines which level the labels are inserted into. By default it is inserted into the first level.
        - ***col_fill*** : *object*, default ''
            - If the columns have multiple levels, determines how the other levels are named. If None then the index name is repeated.

    - **Returns**
        - *DataFrame* with the new index.

In [ ]:
# reset_index()로 인덱스를 기본값 상태로 바꾼다.
df.reset_index()

  index   A     B  C    D          E
0     a  73  0.35  4    A 2050-04-10
1     b -29  0.12  0    A 2050-04-11
2     c  85  0.71  3    A 2050-04-12
3     d -32 -0.09  0    B 2050-04-13
4     e  97 -1.21  2    B 2050-04-14
5     f  11  1.32  5    b 2050-04-15
6     g  55 -0.65  3  NaN 2050-04-16
7     h -78  0.34  0    C 2050-04-17
8     i  49 -1.23  1    A 2050-04-18
9     j  61 -0.79  2    B 2050-04-19

In [ ]:
# 기존의 인덱스를 삭제하면서 새로운 열로 추가하지 않는다.
df.reset_index(drop=True)

    A     B  C    D          E
0  73  0.35  4    A 2050-04-10
1 -29  0.12  0    A 2050-04-11
2  85  0.71  3    A 2050-04-12
3 -32 -0.09  0    B 2050-04-13
4  97 -1.21  2    B 2050-04-14
5  11  1.32  5    b 2050-04-15
6  55 -0.65  3  NaN 2050-04-16
7 -78  0.34  0    C 2050-04-17
8  49 -1.23  1    A 2050-04-18
9  61 -0.79  2    B 2050-04-19

In [ ]:
df  # 원본 데이터프레임은 그대로이다.

    A     B  C    D          E
a  73  0.35  4    A 2050-04-10
b -29  0.12  0    A 2050-04-11
c  85  0.71  3    A 2050-04-12
d -32 -0.09  0    B 2050-04-13
e  97 -1.21  2    B 2050-04-14
f  11  1.32  5    b 2050-04-15
g  55 -0.65  3  NaN 2050-04-16
h -78  0.34  0    C 2050-04-17
i  49 -1.23  1    A 2050-04-18
j  61 -0.79  2    B 2050-04-19

**<font size='+1'>원본 데이터프레임 자체의 인덱스 갱신</font>**

In [ ]:
df = pandas.DataFrame({'A': list(range(1, 6)), 
                       'B': list(range(2, 7)),
                       'C': list(range(3, 8))},
                      index=list(range(1, 6)))
df

   A  B  C
1  1  2  3
2  2  3  4
3  3  4  5
4  4  5  6
5  5  6  7

In [ ]:
# --- set_index()로 원본 데이터프레임 자체의 인덱스를 기존 열 'B'로 바꾼다.
df.set_index('B', inplace=True)

In [ ]:
df  # 원본 데이터프레임이 바뀌었다.

   A  C
B
2  1  3
3  2  4
4  3  5
5  4  6
6  5  7

# 데이터프레임 갱신

In [ ]:
n = 4, 0, 3, 0, 2, 5, 3, 0, 1, 2
integers = 73, -29, 85, -32, 97, 11, 55, -78, 49, 61
floats = 0.35,  0.12,  0.71, -0.09, -1.21, 1.32, -0.65, 0.34, -1.23, -0.79

df = pandas.DataFrame({'A': integers,
                       'B': floats,
                       'C': n},
                      index=list('abcdefghij'))
df

    A     B  C
a  73  0.35  4
b -29  0.12  0
c  85  0.71  3
d -32 -0.09  0
e  97 -1.21  2
f  11  1.32  5
g  55 -0.65  3
h -78  0.34  0
i  49 -1.23  1
j  61 -0.79  2

**<font size='+2'>추가(insertion)</font>**

새로운 열과 데이터 혹은 행 데이터를 추가할 수 있다.

**<font size='+1'>행 추가</font>**

**loc**을 사용하여 새로운 데이터를 추가할 수 있다. 
- DataFrame.**loc[인덱스]** = **데이터**
- 이 때, **데이터**로
    + pandas.**Series**, 리스트, 튜플 등 1차원 데이터, 혹은
    + 숫자, 문자열 등 스칼라 값이 올 수 있다.

In [ ]:
# 인덱스가 'z'인 행 데이터 0, 0, 0을 추가한다.
df.loc['z'] = [0] * 3 
df.tail(3)

    A     B  C
i  49 -1.23  1
j  61 -0.79  2
z   0  0.00  0

**<font size='+1'>열 추가</font>**

다음과 같이 열을 추가할 수 있다.
- DataFrame.**[열이름]** = **데이터**
- 이 때, **데이터**로
    + pandas.**Series**, 리스트, 튜플, 딕셔너리 등 1차원 데이터, 혹은
    + 숫자, 문자열 등 스칼라 값이 올 수 있다. 
- **열이름**이 없으면, **데이터**로 **열이름**의 새로운 열을 추가한다. 
- **열이름**이 있으면, 해당 열의 값을 **데이터**로 갱신한다.

In [ ]:
# 1차원 데이터를 이용하여 열을 추가한다.
df['D'] = list('AAABBb') + [numpy.nan] + list('CABD')
df

    A     B  C    D
a  73  0.35  4    A
b -29  0.12  0    A
c  85  0.71  3    A
d -32 -0.09  0    B
e  97 -1.21  2    B
f  11  1.32  5    b
g  55 -0.65  3  NaN
h -78  0.34  0    C
i  49 -1.23  1    A
j  61 -0.79  2    B
z   0  0.00  0    D

In [ ]:
# 1차원 데이터를 이용하여 열을 추가한다.
df['E'] = pandas.Series(pandas.date_range('20500410', periods=len(df.index)),
                        index=list('hijabcdefgz'))  # 기존 인덱스와 일치해야 한다.
df

# --- (참고) 만약 다음과 같이 딕셔너리로 만들어 추가하면 키만 추가되고 매핑값은 무시된다.
# df['E'] = {
#     '2050-04-15': 0,
#     '2050-04-16': 1,
#     '2050-04-17': 2,
#     '2050-04-18': 3,
#     '2050-04-19': 3,
#     '2050-04-10': 3,
#     '2050-04-11': 3,
#     '2050-04-12': 3,
#     '2050-04-13': 4,
#     '2050-04-14': 5,
#     '2050-04-20': 5
# }

    A     B  C    D          E
a  73  0.35  4    A 2050-04-13
b -29  0.12  0    A 2050-04-14
c  85  0.71  3    A 2050-04-15
d -32 -0.09  0    B 2050-04-16
e  97 -1.21  2    B 2050-04-17
f  11  1.32  5    b 2050-04-18
g  55 -0.65  3  NaN 2050-04-19
h -78  0.34  0    C 2050-04-10
i  49 -1.23  1    A 2050-04-11
j  61 -0.79  2    B 2050-04-12
z   0  0.00  0    D 2050-04-20

In [ ]:
# 스칼라 값으로 열을 추가한다. 
df['F'] = '파이썬'
df

    A     B  C    D          E    F
a  73  0.35  4    A 2050-04-13  파이썬
b -29  0.12  0    A 2050-04-14  파이썬
c  85  0.71  3    A 2050-04-15  파이썬
d -32 -0.09  0    B 2050-04-16  파이썬
e  97 -1.21  2    B 2050-04-17  파이썬
f  11  1.32  5    b 2050-04-18  파이썬
g  55 -0.65  3  NaN 2050-04-19  파이썬
h -78  0.34  0    C 2050-04-10  파이썬
i  49 -1.23  1    A 2050-04-11  파이썬
j  61 -0.79  2    B 2050-04-12  파이썬
z   0  0.00  0    D 2050-04-20  파이썬

In [ ]:
# 두 개 열의 값을 사용하여 새로운 열을 추가한다.
# G = A / ((B / 10) ^ 2)
df['G'] = df.A / (df['B'] / 10) ** 2
df

    A     B  C    D          E    F              G
a  73  0.35  4    A 2050-04-13  파이썬   59591.836735
b -29  0.12  0    A 2050-04-14  파이썬 -201388.888889
c  85  0.71  3    A 2050-04-15  파이썬   16861.733783
d -32 -0.09  0    B 2050-04-16  파이썬 -395061.728395
e  97 -1.21  2    B 2050-04-17  파이썬    6625.230517
f  11  1.32  5    b 2050-04-18  파이썬     631.313131
g  55 -0.65  3  NaN 2050-04-19  파이썬   13017.751479
h -78  0.34  0    C 2050-04-10  파이썬  -67474.048443
i  49 -1.23  1    A 2050-04-11  파이썬    3238.812876
j  61 -0.79  2    B 2050-04-12  파이썬    9774.074668
z   0  0.00  0    D 2050-04-20  파이썬            NaN

In [ ]:
# 'B' 열의 값이 0보다 크면 True, 0.0 또는 음수면 False를 값으로 갖는 열을 추가한다.
df['Positive'] = df.B > 0
df

    A     B  C    D          E    F              G  Positive
a  73  0.35  4    A 2050-04-13  파이썬   59591.836735      True
b -29  0.12  0    A 2050-04-14  파이썬 -201388.888889      True
c  85  0.71  3    A 2050-04-15  파이썬   16861.733783      True
d -32 -0.09  0    B 2050-04-16  파이썬 -395061.728395     False
e  97 -1.21  2    B 2050-04-17  파이썬    6625.230517     False
f  11  1.32  5    b 2050-04-18  파이썬     631.313131      True
g  55 -0.65  3  NaN 2050-04-19  파이썬   13017.751479     False
h -78  0.34  0    C 2050-04-10  파이썬  -67474.048443      True
i  49 -1.23  1    A 2050-04-11  파이썬    3238.812876     False
j  61 -0.79  2    B 2050-04-12  파이썬    9774.074668     False
z   0  0.00  0    D 2050-04-20  파이썬            NaN     False

**<font size='+1'>갱신(update)</font>**

**<font size='+1'>셀 데이터 갱신</font>**
- **at** 혹은 **iat**을 사용해서 특정 셀의 값을 갱신할 수 있다.
    + DataFrame.**at[인덱스, 열이름]** = 데이터
    + DataFrame.**iat[행번호, 열번호]** = 데이터

In [ ]:
df

    A     B  C    D          E    F              G  Positive
a  73  0.35  4    A 2050-04-13  파이썬   59591.836735      True
b -29  0.12  0    A 2050-04-14  파이썬 -201388.888889      True
c  85  0.71  3    A 2050-04-15  파이썬   16861.733783      True
d -32 -0.09  0    B 2050-04-16  파이썬 -395061.728395     False
e  97 -1.21  2    B 2050-04-17  파이썬    6625.230517     False
f  11  1.32  5    b 2050-04-18  파이썬     631.313131      True
g  55 -0.65  3  NaN 2050-04-19  파이썬   13017.751479     False
h -78  0.34  0    C 2050-04-10  파이썬  -67474.048443      True
i  49 -1.23  1    A 2050-04-11  파이썬    3238.812876     False
j  61 -0.79  2    B 2050-04-12  파이썬    9774.074668     False
z   0  0.00  0    D 2050-04-20  파이썬            NaN     False

In [ ]:
# --- Update value by label
# 인덱스와 컬럼 이름으로 셀 값을 갱신한다.
# 인덱스 'z'의 'C' 열을 값을 -1로 갱신한다.
df.at['z', 'C'] = -1

# --- Update value by position
# 행과 열 위치로 셀 값을 갱신한다.
# 마지막 행의 두 번째 열의 값을 -1.0으로 갱신한다.
df.iat[-1, 1] = -1.0

# 결과를 확인한다.
df.tail(2)

    A     B  C  D          E    F            G  Positive
j  61 -0.79  2  B 2050-04-12  파이썬  9774.074668     False
z   0 -1.00 -1  D 2050-04-20  파이썬          NaN     False

**<font size='+1'>행/열 데이터 갱신</font>**
- **loc** 혹은 **iloc**을 사용하여 특정 행/열의 일부 또는 모든 값을 갱신할 수 있다.

In [ ]:
df

    A     B  C    D          E    F              G  Positive
a  73  0.35  4    A 2050-04-13  파이썬   59591.836735      True
b -29  0.12  0    A 2050-04-14  파이썬 -201388.888889      True
c  85  0.71  3    A 2050-04-15  파이썬   16861.733783      True
d -32 -0.09  0    B 2050-04-16  파이썬 -395061.728395     False
e  97 -1.21  2    B 2050-04-17  파이썬    6625.230517     False
f  11  1.32  5    b 2050-04-18  파이썬     631.313131      True
g  55 -0.65  3  NaN 2050-04-19  파이썬   13017.751479     False
h -78  0.34  0    C 2050-04-10  파이썬  -67474.048443      True
i  49 -1.23  1    A 2050-04-11  파이썬    3238.812876     False
j  61 -0.79  2    B 2050-04-12  파이썬    9774.074668     False
z   0 -1.00 -1    D 2050-04-20  파이썬            NaN     False

In [ ]:
# --- 특정 행의 일부 값을 갱신한다.
# 인덱스 'z'의 'D', 'E' 열을 값을 각각 numpy.nan, pandas.NaT로 갱신한다.
df.loc['z', ['D','E']] = [numpy.nan, pandas.NaT]
# 또는 df.loc['z', 'D':'E'] = [numpy.nan, pandas.NaT]

# 마지막 행의 첫 세 열의 값을 -100, -100, -100으로 갱신한다.
df.iloc[-1, :3] = -100
# 또는 df.iloc[-1, [0, 1, 2]] = -100

# 결과를 확인한다.
df.tail(2)

     A       B    C    D          E    F            G  Positive
j   61   -0.79    2    B 2050-04-12  파이썬  9774.074668     False
z -100 -100.00 -100  NaN        NaT  파이썬          NaN     False

In [ ]:
# --- 특정 행의 모든 값을 갱신한다.
# 인덱스 'e'의 모든 값을 -15, 0.55, 1, numpy.nan, pandas.NaT, 'Python', 0, None으로 갱신한다.
df.loc['e', :] = [-15, 0.55, 1, numpy.nan, pandas.NaT, 'Python', 0, None]

# 마지막 행의 첫 세 열의 값을 -1000, 1000, 1000로 나머지는 numpy.nan로 갱신한다.
df.iloc[-1, :] = [-1000, 1000, 1000, numpy.nan, numpy.nan, numpy.nan, numpy.nan, numpy.nan]

df

      A        B     C    D          E       F              G  Positive
a    73     0.35     4    A 2050-04-13     파이썬   59591.836735       1.0
b   -29     0.12     0    A 2050-04-14     파이썬 -201388.888889       1.0
c    85     0.71     3    A 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0    B 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1  NaN        NaT  Python       0.000000       NaN
f    11     1.32     5    b 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3  NaN 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0    C 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1    A 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2    B 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000  NaN        NaT     NaN            NaN       NaN

**<font size='+1'>조건문</font>**

In [ ]:
df2 = df.loc[:'j', :'C']
df2

    A     B  C
a  73  0.35  4
b -29  0.12  0
c  85  0.71  3
d -32 -0.09  0
e -15  0.55  1
f  11  1.32  5
g  55 -0.65  3
h -78  0.34  0
i  49 -1.23  1
j  61 -0.79  2

조건을 만족하는 데이터 셀만 갱신할 수 있다.

In [ ]:
# df2에서 3보다 큰 값은 모두 10을 곱한 후 음수로 바꾼다.
df2[df2 > 3] = -(df2 * 10)
df2

     A     B   C
a -730  0.35 -40
b  -29  0.12   0
c -850  0.71   3
d  -32 -0.09   0
e  -15  0.55   1
f -110  1.32 -50
g -550 -0.65   3
h  -78  0.34   0
i -490 -1.23   1
j -610 -0.79   2

In [ ]:
# -100 이하의 값은 모두 NaN으로 바꾼다.
df2[df2 < -100] = numpy.nan
df2

      A     B   C
a   NaN  0.35 -40
b -29.0  0.12   0
c   NaN  0.71   3
d -32.0 -0.09   0
e -15.0  0.55   1
f   NaN  1.32 -50
g   NaN -0.65   3
h -78.0  0.34   0
i   NaN -1.23   1
j   NaN -0.79   2

**<font size='+1'>삭제(drop)</font>**

지정한 한 개 또는 여러 개의 열이나 행을 삭제할 수 있다.
- 라벨 이름과 해당 축을 지정해서 삭제하거나
- 인덱스나 열 이름을 직접 지정해서 삭제할 수 있다.
- 데이터프레임 자체의 열/행을 바꾸려면 **inplace=True**로 설정해야 한다.
- **분할 연산자는 사용할 수 없다.**

열이나 행을 삭제하는 방법은 다음과 같다.
- *new_df* = DataFrame.**drop(인덱스[, axis={0 or 'index'}])**
- *new_df* = DataFrame.**drop(열이름, axis={1 or 'columns'})**
- *dropped_series* = DataFrame.**pop(열이름)**
    + [pandas.DataFrame.pop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pop.html)
- **del** DataFrame **[열이름]**

[pandas.DataFrame.drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html#pandas.DataFrame.drop)
- Drop specified labels from rows or columns.
- Remove rows or columns by specifying label names and corresponding axis, or by specifying directly index or column names. When using a multi-index, labels on different levels can be removed by specifying the level.
- DataFrame.**drop**(*self, labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise'*)
    - ***labels*** : *single label* or *list-like*
        - Index or column labels to drop.
    - ***axis*** : {0 or *'index'*, 1 or *'columns'*}, default 0
        - Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).
    - ***index*** : *single label* or *list-like*
        - Alternative to specifying axis (labels, axis=0 is equivalent to index=labels).
    - ***columns*** : *single label* or *list-like*
        - Alternative to specifying axis (labels, axis=1 is equivalent to columns=labels).
    - ***level*** : *int* or *level name*, optional
        - For MultiIndex, level from which the labels will be removed.
    - ***inplace*** : *bool*, default False
        - If True, do operation inplace and return None.
    - ***errors*** : {*'ignore'*, *'raise'*}, default ‘raise’
        - If ‘ignore’, suppress error and only existing labels are dropped.
    - Returns:	
        - dropped : *pandas.DataFrame*

**<font size='+1'>행 삭제</font>**

In [ ]:
# 인덱스가 'b'인 행을 삭제한다.
new_df = df.drop('b')
new_df

      A        B     C    D          E       F              G  Positive
a    73     0.35     4    A 2050-04-13     파이썬   59591.836735       1.0
c    85     0.71     3    A 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0    B 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1  NaN        NaT  Python       0.000000       NaN
f    11     1.32     5    b 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3  NaN 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0    C 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1    A 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2    B 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000  NaN        NaT     NaN            NaN       NaN

In [ ]:
# 인덱스가 'a'과 'z'인 행을 삭제한다.
new_df = df.drop(['a', 'z'])
new_df

    A     B  C    D          E       F              G  Positive
b -29  0.12  0    A 2050-04-14     파이썬 -201388.888889       1.0
c  85  0.71  3    A 2050-04-15     파이썬   16861.733783       1.0
d -32 -0.09  0    B 2050-04-16     파이썬 -395061.728395       0.0
e -15  0.55  1  NaN        NaT  Python       0.000000       NaN
f  11  1.32  5    b 2050-04-18     파이썬     631.313131       1.0
g  55 -0.65  3  NaN 2050-04-19     파이썬   13017.751479       0.0
h -78  0.34  0    C 2050-04-10     파이썬  -67474.048443       1.0
i  49 -1.23  1    A 2050-04-11     파이썬    3238.812876       0.0
j  61 -0.79  2    B 2050-04-12     파이썬    9774.074668       0.0

In [ ]:
# 분할 연산자를 사용하여 인덱스 'e'부터 'h'까지 행을 삭제한다. 
# 분할 연산자는 사용할 수 없다.
df.drop(['e':'h'])

SyntaxError: ignored

In [ ]:
df  # 원본 데이터프레임은 그대로이다.

      A        B     C    D          E       F              G  Positive
a    73     0.35     4    A 2050-04-13     파이썬   59591.836735       1.0
b   -29     0.12     0    A 2050-04-14     파이썬 -201388.888889       1.0
c    85     0.71     3    A 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0    B 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1  NaN        NaT  Python       0.000000       NaN
f    11     1.32     5    b 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3  NaN 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0    C 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1    A 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2    B 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000  NaN        NaT     NaN            NaN       NaN

**<font size='+1'>열 삭제</font>**

In [ ]:
# 'D' 열을 삭제한다.
new_df = df.drop('D', axis='columns')  # axis=1과 같다.
new_df

      A        B     C          E       F              G  Positive
a    73     0.35     4 2050-04-13     파이썬   59591.836735       1.0
b   -29     0.12     0 2050-04-14     파이썬 -201388.888889       1.0
c    85     0.71     3 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1        NaT  Python       0.000000       NaN
f    11     1.32     5 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000        NaT     NaN            NaN       NaN

In [ ]:
# (방법 1) 'F', 'G', 'Positive' 열을 삭제한다.
df.drop(['F', 'G', 'Positive'], axis=1)  # axis='columns'와 같다.

      A        B     C    D          E
a    73     0.35     4    A 2050-04-13
b   -29     0.12     0    A 2050-04-14
c    85     0.71     3    A 2050-04-15
d   -32    -0.09     0    B 2050-04-16
e   -15     0.55     1  NaN        NaT
f    11     1.32     5    b 2050-04-18
g    55    -0.65     3  NaN 2050-04-19
h   -78     0.34     0    C 2050-04-10
i    49    -1.23     1    A 2050-04-11
j    61    -0.79     2    B 2050-04-12
z -1000  1000.00  1000  NaN        NaT

In [ ]:
# (방법 2) 'A'와 'E' 열을 삭제한다.
df.drop(columns=['F', 'G', 'Positive'])

      A        B     C    D          E
a    73     0.35     4    A 2050-04-13
b   -29     0.12     0    A 2050-04-14
c    85     0.71     3    A 2050-04-15
d   -32    -0.09     0    B 2050-04-16
e   -15     0.55     1  NaN        NaT
f    11     1.32     5    b 2050-04-18
g    55    -0.65     3  NaN 2050-04-19
h   -78     0.34     0    C 2050-04-10
i    49    -1.23     1    A 2050-04-11
j    61    -0.79     2    B 2050-04-12
z -1000  1000.00  1000  NaN        NaT

**<font size='+1'>원본 데이터프레임 자체의 행/열 삭제</font>**

In [ ]:
df

      A        B     C    D          E       F              G  Positive
a    73     0.35     4    A 2050-04-13     파이썬   59591.836735       1.0
b   -29     0.12     0    A 2050-04-14     파이썬 -201388.888889       1.0
c    85     0.71     3    A 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0    B 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1  NaN        NaT  Python       0.000000       NaN
f    11     1.32     5    b 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3  NaN 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0    C 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1    A 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2    B 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000  NaN        NaT     NaN            NaN       NaN

In [ ]:
# 인덱스가 'b'인 행을 삭제한다.
df.drop('b', inplace=True)
df

      A        B     C    D          E       F              G  Positive
a    73     0.35     4    A 2050-04-13     파이썬   59591.836735       1.0
c    85     0.71     3    A 2050-04-15     파이썬   16861.733783       1.0
d   -32    -0.09     0    B 2050-04-16     파이썬 -395061.728395       0.0
e   -15     0.55     1  NaN        NaT  Python       0.000000       NaN
f    11     1.32     5    b 2050-04-18     파이썬     631.313131       1.0
g    55    -0.65     3  NaN 2050-04-19     파이썬   13017.751479       0.0
h   -78     0.34     0    C 2050-04-10     파이썬  -67474.048443       1.0
i    49    -1.23     1    A 2050-04-11     파이썬    3238.812876       0.0
j    61    -0.79     2    B 2050-04-12     파이썬    9774.074668       0.0
z -1000  1000.00  1000  NaN        NaT     NaN            NaN       NaN

In [ ]:
# 인덱스가 'a'과 'z'인 행을 삭제한다.
df.drop(['a', 'z'], inplace=True)
df

    A     B  C    D          E       F              G  Positive
c  85  0.71  3    A 2050-04-15     파이썬   16861.733783       1.0
d -32 -0.09  0    B 2050-04-16     파이썬 -395061.728395       0.0
e -15  0.55  1  NaN        NaT  Python       0.000000       NaN
f  11  1.32  5    b 2050-04-18     파이썬     631.313131       1.0
g  55 -0.65  3  NaN 2050-04-19     파이썬   13017.751479       0.0
h -78  0.34  0    C 2050-04-10     파이썬  -67474.048443       1.0
i  49 -1.23  1    A 2050-04-11     파이썬    3238.812876       0.0
j  61 -0.79  2    B 2050-04-12     파이썬    9774.074668       0.0

In [ ]:
# 'F' 열을 삭제한다.
df.drop('F', axis=1, inplace=True)  # axis='columns'와 같다.
df

    A     B  C    D          E              G  Positive
c  85  0.71  3    A 2050-04-15   16861.733783       1.0
d -32 -0.09  0    B 2050-04-16 -395061.728395       0.0
e -15  0.55  1  NaN        NaT       0.000000       NaN
f  11  1.32  5    b 2050-04-18     631.313131       1.0
g  55 -0.65  3  NaN 2050-04-19   13017.751479       0.0
h -78  0.34  0    C 2050-04-10  -67474.048443       1.0
i  49 -1.23  1    A 2050-04-11    3238.812876       0.0
j  61 -0.79  2    B 2050-04-12    9774.074668       0.0

In [ ]:
# 'A'와 'G' 열을 삭제한다.
df.drop(columns=['A', 'G'], inplace=True)

# df.drop(['A', 'G'], axis='columns', inplace=True)와 같다.
df

      B  C    D          E  Positive
c  0.71  3    A 2050-04-15       1.0
d -0.09  0    B 2050-04-16       0.0
e  0.55  1  NaN        NaT       NaN
f  1.32  5    b 2050-04-18       1.0
g -0.65  3  NaN 2050-04-19       0.0
h  0.34  0    C 2050-04-10       1.0
i -1.23  1    A 2050-04-11       0.0
j -0.79  2    B 2050-04-12       0.0

In [ ]:
# pop()으로 'E' 열을 삭제한다.
s = df.pop('E')
s

c   2050-04-15
d   2050-04-16
e          NaT
f   2050-04-18
g   2050-04-19
h   2050-04-10
i   2050-04-11
j   2050-04-12
Name: E, dtype: datetime64[ns]

In [ ]:
df

      B  C    D  Positive
c  0.71  3    A       1.0
d -0.09  0    B       0.0
e  0.55  1  NaN       NaN
f  1.32  5    b       1.0
g -0.65  3  NaN       0.0
h  0.34  0    C       1.0
i -1.23  1    A       0.0
j -0.79  2    B       0.0

In [ ]:
# del로 'Positive' 열을 삭제한다.
del df['Positive']
df

      B  C    D
c  0.71  3    A
d -0.09  0    B
e  0.55  1  NaN
f  1.32  5    b
g -0.65  3  NaN
h  0.34  0    C
i -1.23  1    A
j -0.79  2    B

In [ ]:
df  # 원본 데이터프레임이 바꿨다.

      B  C    D
c  0.71  3    A
d -0.09  0    B
e  0.55  1  NaN
f  1.32  5    b
g -0.65  3  NaN
h  0.34  0    C
i -1.23  1    A
j -0.79  2    B

# 데이터프레임 병합

## **concat()** 메소드

데이터프레임을 결합한다.
- **동종** 형태의 자료형으로 구성된 리스트 혹은 딕셔너리 형태의 데이터프레임이나 시리저를 받아서 이들을 결합한다.
- 오래된 시리즈/데이터프레임의 **append()** 메소드보다 권장하는 방식이다.
- **concat()**/**append()**: 데이터의 전체 복사본을 만들어 반환하기 때문에, 이 메소드를 지속적으로 사용하면 상당한 성능 저하가 발생할 수 있다는 점에 유의하자.

**<font size='+1'>축을 따로 설정하지 않는 경우(axis=0/index)</font>**
- 행을 결합한다.
- 기본값은 **outer join**이다.

In [ ]:
df1 = pandas.DataFrame([[1, 2, 3], [4, 5, 6]],
                       index=list('ab'),
                       columns=list('ABC'))

df2 = pandas.DataFrame([[4, 5, 6], [7, 8, 9]],
                       index=list('ab'),
                       columns=list('ABC'))

In [ ]:
df1

   A  B  C
a  1  2  3
b  4  5  6

In [ ]:
df2

   A  B  C
a  4  5  6
b  7  8  9

In [ ]:
# df1과 df2를 기본값(outer join)으로 결합한다.
# axis='index'/0은 기본값이라 생략할 수 있다.
pandas.concat([df1, df2])

   A  B  C
a  1  2  3
b  4  5  6
a  4  5  6
b  7  8  9

In [ ]:
# 결합 축의 인덱스를 무시한다. 
# 즉, df1과 df2의 기존 인덱스를 무시하고 인덱스의 기본값을 사용한다.
pandas.concat([df1, df2], ignore_index=True)

   A  B  C
0  1  2  3
1  4  5  6
2  4  5  6
3  7  8  9

In [ ]:
# 매개변수 keys를 사용하여 df1과 df2를 다중 인덱스로 결합한다.
df_keys = pandas.concat([df1, df2], keys=['table1', 'table2'])
df_keys

          A  B  C
table1 a  1  2  3
       b  4  5  6
table2 a  4  5  6
       b  7  8  9

In [ ]:
# df_keys의 인덱스를 열람한다.
df_keys.index

MultiIndex([('table1', 'a'),
            ('table1', 'b'),
            ('table2', 'a'),
            ('table2', 'b')],
           )

**<font size='+1'>축을 1로 설정하는 경우(axis=1/columns)</font>**
- 열(컬럼)을 결합한다.

**df1** / **df2**
<pre>
   A  B  C
a  1  2  3
b  4  5  6

   A  B  C
a  4  5  6
b  7  8  9
</pre>

In [ ]:
# df1과 df2의 열(컬럼)을 결합 축으로 하고 기본값(outer join)으로 결합한다.
pandas.concat([df1, df2], axis='columns')

   A  B  C  A  B  C
a  1  2  3  4  5  6
b  4  5  6  7  8  9

In [ ]:
# df1과 df2의 열(컬럼)을 결합 축으로 하고 기본값(outer join)으로 결합한다.
# 결합 축의 인덱스를 무시한다. 
# 즉, df1과 df2의 기존 인덱스를 무시하고 인덱스의 기본값을 사용한다.
pandas.concat([df1, df2], axis=1, ignore_index=True)

   0  1  2  3  4  5
a  1  2  3  4  5  6
b  4  5  6  7  8  9

**<font size='+1'>인덱스 중복 값 확인</font>**
- 인덱스의 값이 중복되는지 여부를 확인한다.

In [ ]:
df1 = pandas.DataFrame(numpy.arange(1, 7).reshape(3, 2),
                       columns=list('AB'))

df2 = pandas.DataFrame(numpy.arange(1, 7).reshape(3, 2),
                       index=[1, 2, 3],
                       columns=['B', 'C'])

In [ ]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [ ]:
df2

   B  C
1  1  2
2  3  4
3  5  6

In [ ]:
# 행 축으로 결합하면서 중복 여부를 확인한다. 
# 인덱스에 중복 값이 있으면 오류가 난다.
pandas.concat([df1, df2], verify_integrity=True)

ValueError: ignored

In [ ]:
# 열 축으로 결합하면서 중복 여부를 확인한다. 
# 열 이름에 중복이 있으면 오류가 난다.
pandas.concat([df1, df2], axis=1, verify_integrity=True)

ValueError: ignored

## **merge()** 메소드

데이터프레임을 병합한다.
- 고성능 인메모리(in-memory) 조인(join) 연산을 수행한다.
- 관계형 데이터베이스의 조인(join) 연산과 유사하다. 
    - 따라서 축과 축 이름을 기준으로 데이터를 결합하는 **concat()** 메소드와 달리 **셀의 데이터 값을 기준으로 결합**하기 때문에 데이터베이스의 SQL과 유사하게 작동한다.
- 디폴트는 **inner join**이다.

[pandas.merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.merge.html#pandas.merge)
- Merge DataFrame or named Series objects with a database-style join.
- The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.
- pandas.**merge**(*left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None*)
    - ***how*** : {*'left'*, *'right'*, *'outer'*, *'inner'*}, default *'inner'*
        - Type of merge to be performed.
        - ***left***: use only keys from left frame, similar to a SQL **left outer join**; preserve key order.
        - ***right***: use only keys from right frame, similar to a SQL **right outer join**; preserve key order.
        - ***outer***: use *union* of keys from both frames, similar to a SQL **full outer join**; sort keys lexicographically.
        - ***inner***: use intersection of keys from both frames, similar to a SQL **inner join**; preserve the order of the left keys.
    - ***on*** : *label* or *list*
        - Column or index level names to join on. These must be found in both DataFrames. If on *is None and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.
    - ***left_on*** : *label* or *list*, or *array-like*
        - Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.
    - ***right_on*** : *label* or *list*, or *array-like*
        - Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns.
    - ***left_index*** : *bool*, default False
        - Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.
    - ***right_index*** : *bool*, default False
        - Use the index from the right DataFrame as the join key. Same caveats as left_index.
    - ***suffixes*** : *tuple of (str, str)*, default (‘_x’, ‘_y’)
        - Suffix to apply to overlapping column names in the left and right side, respectively. To raise an exception on overlapping columns use (False, False).
    - ***indicator*** : *bool* or *str*, default False
        - If True, adds a column to output DataFrame called “_merge” with information on the source of each row. If string, column with information on source of each row will be added to output DataFrame, and column will be named value of string. Information column is Categorical-type and takes on a value of “left_only” for observations whose merge key only appears in ‘left’ DataFrame, “right_only” for observations whose merge key only appears in ‘right’ DataFrame, and “both” if the observation’s merge key is found in both.
    - ***validate*** : *str*, optional
        - If specified, checks if merge is of specified type.
            - **'one_to_one'** or **'1:1'**: check if merge keys are unique in both left and right datasets.
            - **'one_to_many'** or **'1:m'**: check if merge keys are unique in left dataset.
            - **'many_to_one'** or **'m:1'**: check if merge keys are unique in right dataset.
            - **'many_to_many'** or **'m:m'**: allowed, but does not result in checks.
    - Returns:
        - DataFrame
            - A DataFrame of the two merged objects.

**<font size='+1'>중복 키와 Catesian product</font>**

In [ ]:
df1 = pandas.DataFrame({'key': list('가나다가라'),
                        'data': list(range(10, 15)),
                        'ldata': list(range(15, 20))})

df2 = pandas.DataFrame({'key': list('나가다마다'), 
                        'data': list(range(20, 25)),
                        'rdata': list(range(25, 30))})

In [ ]:
df1

  key  data  ldata
0   가    10     15
1   나    11     16
2   다    12     17
3   가    13     18
4   라    14     19

In [ ]:
df2

  key  data  rdata
0   나    20     25
1   가    21     26
2   다    22     27
3   마    23     28
4   다    24     29

In [ ]:
# --- df1과 df2는 키 열의 이름이 같고 일부 열 이름이 다르다.
# 병합하는 열을 'key'로 지정하고 기본값(inner join)으로 병합한다.
pandas.merge(df1, df2, on='key')

  key  data_x  ldata  data_y  rdata
0   가      10     15      21     26
1   가      13     18      21     26
2   나      11     16      20     25
3   다      12     17      22     27
4   다      12     17      24     29

In [ ]:
# --- df1과 df2는 키 열의 이름이 같고 일부 열 이름이 다르다.
# 병합하는 열을 'key'로 지정하고 기본값(inner join)으로 병합한다.
# 이 때 병합 정보를 포함하도록 한다.
pandas.merge(df1, df2, on='key', indicator=True)

  key  data_x  ldata  data_y  rdata _merge
0   가      10     15      21     26   both
1   가      13     18      21     26   both
2   나      11     16      20     25   both
3   다      12     17      22     27   both
4   다      12     17      24     29   both

In [ ]:
# --- df1과 df2는 키 열의 이름이 같고 일부 열 이름이 다르다.
# 병합하는 열을 'key'로 지정하고 outer join으로 병합한다.
# 이 때 병합 정보를 포함하도록 한다.
pandas.merge(df1, df2, 
             how='outer', on='key', 
             indicator=True)

  key  data_x  ldata  data_y  rdata      _merge
0   가    10.0   15.0    21.0   26.0        both
1   가    13.0   18.0    21.0   26.0        both
2   나    11.0   16.0    20.0   25.0        both
3   다    12.0   17.0    22.0   27.0        both
4   다    12.0   17.0    24.0   29.0        both
5   라    14.0   19.0     NaN    NaN   left_only
6   마     NaN    NaN    23.0   28.0  right_only

In [ ]:
# --- df1과 df2는 키 열의 이름이 같고 일부 열 이름이 다르다.
# 병합하는 열을 'key'로 지정하고 left outer join으로 병합한다.
# 이 때 병합하는 열 이외 같은 이름을 가진 열을 구분하기 위해 
# 접미어를 지정하고 병합 정보를 포함하도록 한다.
pandas.merge(df1, df2, how='left', on='key', 
             suffixes=['_left', '_right'],
             indicator=True)

  key  data_left  ldata  data_right  rdata     _merge
0   가         10     15        21.0   26.0       both
1   나         11     16        20.0   25.0       both
2   다         12     17        22.0   27.0       both
3   다         12     17        24.0   29.0       both
4   가         13     18        21.0   26.0       both
5   라         14     19         NaN    NaN  left_only

In [ ]:
# --- df1과 df2는 키 열의 이름이 같고 일부 열 이름이 다르다.
# 병합하는 열을 'key'로 지정하고 right outer join으로 병합한다.
# 이 때 병합하는 열 이외 같은 이름을 가진 열을 구분하기 위해 
# 접미어를 지정하고 병합 정보를 포함하도록 한다.
pandas.merge(df1, df2, how='right', on='key', 
             suffixes=['_left', '_right'],
             indicator=True)

  key  data_left  ldata  data_right  rdata      _merge
0   가       10.0   15.0          21     26        both
1   가       13.0   18.0          21     26        both
2   나       11.0   16.0          20     25        both
3   다       12.0   17.0          22     27        both
4   다       12.0   17.0          24     29        both
5   마        NaN    NaN          23     28  right_only

# 피벗 테이블

[pandas.pivot_table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html)
- Create a spreadsheet-style pivot table as a DataFrame.
- The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.
- pandas.**pivot_table**(*data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False*)
    + ***data*** : *DataFrame*
    + ***values*** : *column to aggregate, optional*
    + ***index*** : *column, Grouper, array, or list of the previous*
        - If an array is passed, it must be the same length as the **data**. The list can contain any of the other types (except list). Keys to group by on the pivot table index. If an array is passed, it is being used as the same manner as column values.
    + ***columns*** : *column, Grouper, array, or list of the previous*
        - If an array is passed, it must be the same length as the **data**. The list can contain any of the other types (except list). Keys to group by on the pivot table column. If an array is passed, it is being used as the same manner as column values.
    + ***aggfunc*** : *function, list of functions, dict, default numpy.mean*
        - If **list** of functions passed, the resulting pivot table will have hierarchical columns whose top level are the function names (inferred from the function objects themselves) 
        - If **dict** is passed, the ***key*** is column to aggregate and ***value*** is function or list of functions.
    + ***fill_value*** : *scalar, default None*
        - Value to replace missing values with.
    + ***margins*** : *bool, default False*
        - Add all row / columns (e.g. for subtotal / grand totals).
    + ***dropna*** : *bool, default True*
        - Do not include columns whose entries are all **NaN**.
    + ***margins_name*** : *str, default 'All'*
        - Name of the row / column that will contain the totals when ***margins*** is **True**.
    + ***observed*** : *bool, default False*
        - This only applies if any of the groupers are Categoricals. 
        - If **True**: only show observed values for categorical groupers. 
        - If **False**: show all values for categorical groupers.
    * Returns : *DataFrame*
        - An Excel style pivot table.

실습을 위해 저장해둔 파일을 내려받도록 한다.
- 이 데이터는 MovieLens 1M Dataset 중 나이가 **1**살로 기록되어 있는 **user id**가 **1**인 데이터만 생략했다. 
- 그리고 'timestamp', 'movie_id', 'genres' 열을 제외한 데이터로 파일 크기는 약 **45**MB다.
- [MovieLens 1M Dataset](https://grouplens.org/datasets/movielens/1m/)은 6,000명의 사용자가 4,000개의 영화에 대한 100만개의 평점 데이터로 이루어져 있다.


이 실습에 사용하는 데이터 출처
- https://grouplens.org/datasets/movielens/1m/

In [ ]:
!wget -O movielens1m-modified-merge.csv -q --show-progress --no-check-certificate 'https://drive.google.com/uc?export=download&id=1WTwd30tHq12OMWL-CR4bXp16hSkky3Vt'

movielens1m-modifie     [  <=>               ]  43.01M   110MB/s    in 0.4s

In [ ]:
import pandas  # as pd
import numpy   # as np 
print('Pandas version...:', pandas.__version__)
print('NumPy version....:', numpy.__version__)

Pandas version...: 1.0.5
NumPy version....: 1.18.5

In [ ]:
df = pandas.read_csv('movielens1m-modified-merge.csv')
df

         user_id  rating  ...    zip                                        title
0              2       5  ...  70072       One Flew Over the Cuckoo's Nest (1975)
1             12       4  ...  32793       One Flew Over the Cuckoo's Nest (1975)
2             15       4  ...  22903       One Flew Over the Cuckoo's Nest (1975)
3             17       5  ...  95350       One Flew Over the Cuckoo's Nest (1975)
4             18       4  ...  95825       One Flew Over the Cuckoo's Nest (1975)
...          ...     ...  ...    ...                                          ...
1000151     5949       5  ...  47901                           Modulations (1998)
1000152     5675       3  ...  30030                        Broken Vessels (1998)
1000153     5780       1  ...  92886                            White Boys (1999)
1000154     5851       5  ...  55410                     One Little Indian (1973)
1000155     5938       4  ...  35401  Five Wives, Three Secretaries and Me (1998)

[1000156 rows x 7 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000156 entries, 0 to 1000155
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   user_id     1000156 non-null  int64
 1   rating      1000156 non-null  int64
 2   gender      1000156 non-null  object
 3   age         1000156 non-null  int64
 4   occupation  1000156 non-null  int64
 5   zip         1000156 non-null  object
 6   title       1000156 non-null  object
dtypes: int64(4), object(3)
memory usage: 53.4+ MB

In [ ]:
# 사용자 ID의 자료형을 문자열로 바꾼다.
df['user_id'] = df['user_id'].astype('str')

In [ ]:
df.dtypes

user_id       object
rating         int64
gender        object
age            int64
occupation     int64
zip           object
title         object
dtype: object

In [ ]:
# '직업(occupation)'별로로 정렬한다. 
# 이때 수치 데이터를 담고 있는 열만 포함되며,
# '직업(occupation)'의 중복값은 하나로 합쳐지면서 해당 값들은 평균을 구해 보여준다. 
# 즉, 평균치가 기본값이다.
pandas.pivot_table(df, index='occupation')

                  age    rating
occupation
0           29.296937  3.537544
1           33.652271  3.576642
2           29.641827  3.573081
3           31.396420  3.656516
4           20.618002  3.536793
5           29.430984  3.537529
6           35.590001  3.661578
7           33.483766  3.599772
8           40.762380  3.466741
9           33.638960  3.656589
10           4.220898  3.531179
11          33.071925  3.617371
12          29.352536  3.654001
13          52.476807  3.781736
14          29.404040  3.618481
15          29.642848  3.689774
16          36.165164  3.596575
17          31.807075  3.613574
18          32.269237  3.530117
19          23.549181  3.414050
20          30.734126  3.497392

In [ ]:
# 인덱스를 여러 개 지정할 수도 있다.
# 인덱스로 직업(occupation)에 따른 성(gender)별로 구분하여 설정한다.
pandas.pivot_table(df, index=['occupation', 'gender'])

                         age    rating
occupation gender
0          F       29.990226  3.686842
           M       29.062806  3.487125
1          F       32.790766  3.584606
           M       34.182911  3.571737
2          F       31.275514  3.555888
           M       28.871039  3.581192
3          F       30.832810  3.687679
           M       31.863163  3.630709
4          F       20.889570  3.547252
           M       20.528559  3.533348
5          F       32.263252  3.584891
           M       28.814656  3.527222
6          F       37.319648  3.690834
           M       34.424323  3.641861
7          F       32.003729  3.668559
           M       33.787818  3.585641
8          F       48.745283  3.363208
           M       38.309662  3.498551
9          F       33.744173  3.668467
           M       32.235145  3.498104
10         F        1.412121  3.567677
           M        5.414546  3.515668
11         F       32.767688  3.796822
           M       33.116797  3.590904
12         F       32.558054  3.677102
           M       28.919877  3.650883
13         F       54.238657  3.903894
           M       52.026654  3.750525
14         F       27.703728  3.583702
           M       29.953206  3.629714
15         F       29.472130  3.796093
           M       29.681064  3.665973
16         F       37.957521  3.655868
           M       35.819579  3.585143
17         F       30.125899  3.649366
           M       32.004404  3.609373
18         F       41.425121  4.108696
           M       31.944483  3.509596
19         F       24.159228  3.445724
           M       23.363835  3.404427
20         F       30.692244  3.467402
           M       30.748826  3.507918

In [ ]:
# 특정 값만 지정하여 보여줄 수도 있다.
# 성성(gender)별, 직업(occupation)별로 영화 평점(rating)의 평균을 구한다.
# 합친 열들의 값은 기본값인 펑균치를 보여준다.
pandas.pivot_table(df, 
                   index=['gender', 'occupation'], 
                   values=['rating'])

                     rating
gender occupation
F      0           3.686842
       1           3.584606
       2           3.555888
       3           3.687679
       4           3.547252
       5           3.584891
       6           3.690834
       7           3.668559
       8           3.363208
       9           3.668467
       10          3.567677
       11          3.796822
       12          3.677102
       13          3.903894
       14          3.583702
       15          3.796093
       16          3.655868
       17          3.649366
       18          4.108696
       19          3.445724
       20          3.467402
M      0           3.487125
       1           3.571737
       2           3.581192
       3           3.630709
       4           3.533348
       5           3.527222
       6           3.641861
       7           3.585641
       8           3.498551
       9           3.498104
       10          3.515668
       11          3.590904
       12          3.650883
       13          3.750525
       14          3.629714
       15          3.665973
       16          3.585143
       17          3.609373
       18          3.509596
       19          3.404427
       20          3.507918

In [ ]:
# 기본값인 평균 외 다른 계산을 적용하려면 매개변수 aggfunc에 원하는 함수를 전달인자로 설정하면 된다.
# 이번에는 평균치 대신 합계를 계산해보자.
# 성(gender)별, 직업(occupation)별로 영화 평점(rating)의 총합(numpy.sum)을 구한다.
# import numpy

pandas.pivot_table(df, 
                   index=['gender', 'occupation'], 
                   values=['rating'],
                   aggfunc=numpy.sum)

                   rating
gender occupation
F      0           121463
       1           116618
       2            57072
       3            52826
       4           115158
       5            13999
       6            55285
       7            65913
       8             2139
       9            38717
       10           24724
       11           10035
       12           25019
       13           10927
       14           42965
       15           15936
       16           27196
       17           27914
       18            1701
       19           11967
       20           54407
M      0           340183
       1           188652
       2           121825
       3            62804
       4           348275
       5            63296
       6            80944
       7           313593
       8             7242
       9             2767
       10           57330
       11           64349
       12          184041
       13           41087
       14          134735
       15           68748
       16          138322
       17          235212
       18           40964
       19           38916
       20          156825

In [ ]:
# 이번에는 평균, 합계, 데이터 개수를 조회해보자.
# 성(gender)별, 직업(occupation)별로 영화 평점(rating)의 총합(numpy.sum), 평균(numpy.mean), 데이터 개수(len)를 구한다.
# import numpy

pandas.pivot_table(df, 
                   index=['gender', 'occupation'], 
                   values=['rating'],
                   aggfunc=[numpy.sum, numpy.mean, len])

                      sum      mean    len
                   rating    rating rating
gender occupation
F      0           121463  3.686842  32945
       1           116618  3.584606  32533
       2            57072  3.555888  16050
       3            52826  3.687679  14325
       4           115158  3.547252  32464
       5            13999  3.584891   3905
       6            55285  3.690834  14979
       7            65913  3.668559  17967
       8             2139  3.363208    636
       9            38717  3.668467  10554
       10           24724  3.567677   6930
       11           10035  3.796822   2643
       12           25019  3.677102   6804
       13           10927  3.903894   2799
       14           42965  3.583702  11989
       15           15936  3.796093   4198
       16           27196  3.655868   7439
       17           27914  3.649366   7649
       18            1701  4.108696    414
       19           11967  3.445724   3473
       20           54407  3.467402  15691
M      0           340183  3.487125  97554
       1           188652  3.571737  52818
       2           121825  3.581192  34018
       3            62804  3.630709  17298
       4           348275  3.533348  98568
       5            63296  3.527222  17945
       6            80944  3.641861  22226
       7           313593  3.585641  87458
       8             7242  3.498551   2070
       9             2767  3.498104    791
       10           57330  3.515668  16307
       11           64349  3.590904  17920
       12          184041  3.650883  50410
       13           41087  3.750525  10955
       14          134735  3.629714  37120
       15           68748  3.665973  18753
       16          138322  3.585143  38582
       17          235212  3.609373  65167
       18           40964  3.509596  11672
       19           38916  3.404427  11431
       20          156825  3.507918  44706

In [ ]:
# 각 영화(title)에 대해 성(gender)별로 평가(rating)한 결과의 평균을 계산한다.
# import numpy

pandas.pivot_table(df, 
                   values='rating',
                   index='title', 
                   columns='gender',
                   aggfunc=numpy.mean)  # 평균값이 기본값이라 생락할 수 있다.

gender                                             F         M
title
$1,000,000 Duck (1971)                      3.375000  2.761905
'Night Mother (1986)                        3.388889  3.352941
'Til There Was You (1997)                   2.675676  2.733333
'burbs, The (1989)                          2.793478  2.962085
...And Justice for All (1979)               3.828571  3.689024
...                                              ...       ...
Zed & Two Noughts, A (1985)                 3.500000  3.380952
Zero Effect (1998)                          3.864407  3.723140
Zero Kelvin (Kj�rlighetens kj�tere) (1995)       NaN  3.500000
Zeus and Roxanne (1997)                     2.777778  2.357143
eXistenZ (1999)                             3.098592  3.289086

[3706 rows x 2 columns]

In [ ]:
# 각 영화(title)에 대해 성(gender)별로 평가(rating)한 결과의 평균을 계산한다.
# 결측치가 있으면 NaN 대신 fill_value=0으로 설정한다.
# import numpy

pandas.pivot_table(df, 
                   values='rating',
                   index='title', 
                   columns='gender',
#                    aggfunc=numpy.mean, # 평균값이 기본값이라 생락할 수 있다.
                   fill_value=0)

gender                                             F         M
title
$1,000,000 Duck (1971)                      3.375000  2.761905
'Night Mother (1986)                        3.388889  3.352941
'Til There Was You (1997)                   2.675676  2.733333
'burbs, The (1989)                          2.793478  2.962085
...And Justice for All (1979)               3.828571  3.689024
...                                              ...       ...
Zed & Two Noughts, A (1985)                 3.500000  3.380952
Zero Effect (1998)                          3.864407  3.723140
Zero Kelvin (Kj�rlighetens kj�tere) (1995)  0.000000  3.500000
Zeus and Roxanne (1997)                     2.777778  2.357143
eXistenZ (1999)                             3.098592  3.289086

[3706 rows x 2 columns]

In [ ]:
# 이번에는 각 영화(title)를 직업별, 성(gender)별로 평가(rating)와 사용자 나이의 평균과 데이터의 개수를 계산한다.
# 결측치가 있으면 NaN 대신 fill_value=0으로 설정한다.
# import numpy

pandas.pivot_table(df, 
                   values=['rating', 'age'],
                   index=['title', 'occupation', 'gender'], 
                   aggfunc=[numpy.mean, len],
                   fill_value=0)

                                               mean           len
                                                age    rating age rating
title                  occupation gender
$1,000,000 Duck (1971) 0          F       35.000000  4.000000   2      2
                                  M       25.000000  3.666667   3      3
                       1          F       35.000000  2.666667   3      3
                                  M       40.000000  1.666667   3      3
                       3          F       25.000000  4.000000   1      1
...                                             ...       ...  ..    ...
eXistenZ (1999)        18         M       25.000000  3.000000   2      2
                       19         F       28.333333  3.666667   3      3
                                  M       23.250000  2.500000   4      4
                       20         F       26.500000  2.750000   4      4
                                  M       29.640000  3.320000  25     25

[96955 rows x 4 columns]

In [ ]:
# 이번에는 각 영화(title)를 직업별, 성(gender)별로 평가(rating)와 사용자 나이의 평균과 데이터의 개수를 계산한다.
# 결측치가 있으면 NaN 대신 fill_value=0으로 설정한다.
# 마지막으로 전체 평균과 데이터 개수의 전체 합계도 구한다.
# import numpy

pandas.pivot_table(df, 
                   values=['rating', 'age'],
                   index=['title', 'occupation', 'gender'], 
                   aggfunc=[numpy.mean, len],
                   fill_value=0,
                   margins=True, margins_name='Average/Total')

                                               mean                len
                                                age    rating      age   rating
title                  occupation gender
$1,000,000 Duck (1971) 0          F       35.000000  4.000000        2        2
                                  M       25.000000  3.666667        3        3
                       1          F       35.000000  2.666667        3        3
                                  M       40.000000  1.666667        3        3
                       3          F       25.000000  4.000000        1        1
...                                             ...       ...      ...      ...
eXistenZ (1999)        19         F       28.333333  3.666667        3        3
                                  M       23.250000  2.500000        4        4
                       20         F       26.500000  2.750000        4        4
                                  M       29.640000  3.320000       25       25
Average/Total                             29.739837  3.581532  1000156  1000156

[96956 rows x 4 columns]

- - -

# <font color='red'>THE END</font>